chcbaram/CODING_SOGUL_STM32/boards.txt
Disco.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
Disco.menu.upload_method.swdMethod.upload.protocol=0
Disco.menu.upload_method.swdMethod.upload.options=
Disco.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

Disco.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
Disco.menu.upload_method.serialMethod.upload.protocol=1
Disco.menu.upload_method.serialMethod.upload.options={serial.port.file}
Disco.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

Disco.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
Disco.menu.upload_method.dfuMethod.upload.protocol=2
Disco.menu.upload_method.dfuMethod.upload.options=
Disco.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

################################################################################
# Eval boards

Eval.name=Eval

Eval.build.core=arduino
Eval.build.board=Eval
Eval.build.variant_h=variant_{build.board}.h
Eval.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
Eval.build.flash_offset=0x0
Eval.upload.maximum_size=0
Eval.upload.maximum_data_size=0

# STEVAL_MKSBOX1V1 board
Eval.menu.pnum.STEVAL_MKSBOX1V1=SensorTile.box
Eval.menu.pnum.STEVAL_MKSBOX1V1.upload.maximum_size=2097152
Eval.menu.pnum.STEVAL_MKSBOX1V1.upload.maximum_data_size=655360
Eval.menu.pnum.STEVAL_MKSBOX1V1.build.mcu=cortex-m4
Eval.menu.pnum.STEVAL_MKSBOX1V1.build.fpu=-mfpu=fpv4-sp-d16
Eval.menu.pnum.STEVAL_MKSBOX1V1.build.float-abi=-mfloat-abi=hard
Eval.menu.pnum.STEVAL_MKSBOX1V1.build.board=STEVAL_MKSBOX1V1
Eval.menu.pnum.STEVAL_MKSBOX1V1.build.series=STM32L4xx
Eval.menu.pnum.STEVAL_MKSBOX1V1.build.product_line=STM32L4R9xx
Eval.menu.pnum.STEVAL_MKSBOX1V1.build.variant=STM32L4xx/L4R9Z(G-I)J_L4S9ZIJ
Eval.menu.pnum.STEVAL_MKSBOX1V1.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
Eval.menu.pnum.STEVAL_MKSBOX1V1.build.cmsis_lib_gcc=arm_cortexM4lf_math

# STEVAL_MKBOXPRO board
Eval.menu.pnum.STEVAL_MKBOXPRO=SensorTile.box Pro
Eval.menu.pnum.STEVAL_MKBOXPRO.upload.maximum_size=2097152
Eval.menu.pnum.STEVAL_MKBOXPRO.upload.maximum_data_size=262144
Eval.menu.pnum.STEVAL_MKBOXPRO.build.mcu=cortex-m33
Eval.menu.pnum.STEVAL_MKBOXPRO.build.fpu=-mfpu=fpv4-sp-d16
Eval.menu.pnum.STEVAL_MKBOXPRO.build.float-abi=-mfloat-abi=hard
Eval.menu.pnum.STEVAL_MKBOXPRO.build.board=STEVAL_MKBOXPRO
Eval.menu.pnum.STEVAL_MKBOXPRO.build.series=STM32U5xx
Eval.menu.pnum.STEVAL_MKBOXPRO.build.product_line=STM32U585xx
Eval.menu.pnum.STEVAL_MKBOXPRO.build.variant=STM32U5xx/U575A(G-I)IxQ_U585AIIxQ
Eval.menu.pnum.STEVAL_MKBOXPRO.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
Eval.menu.pnum.STEVAL_MKBOXPRO.build.cmsis_lib_gcc=arm_ARMv8MMLlfsp_math

# Upload menu
Eval.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
Eval.menu.upload_method.swdMethod.upload.protocol=0
Eval.menu.upload_method.swdMethod.upload.options=
Eval.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

Eval.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
Eval.menu.upload_method.dfuMethod.upload.protocol=2
Eval.menu.upload_method.dfuMethod.upload.options=
Eval.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg


###############################
# Generic C0
GenC0.name=Generic STM32C0 series

GenC0.build.core=arduino
GenC0.build.board=GenC0
GenC0.build.mcu=cortex-m0plus
GenC0.build.series=STM32C0xx
GenC0.build.cmsis_lib_gcc=arm_cortexM0l_math
GenC0.build.st_extra_flags=-D{build.product_line} {build.xSerial} -D__CORTEX_SC=0
GenC0.build.flash_offset=0x0
GenC0.upload.maximum_size=0
GenC0.upload.maximum_data_size=0

# Generic C011D6Yx
GenC0.menu.pnum.GENERIC_C011D6YX=Generic C011D6Yx
GenC0.menu.pnum.GENERIC_C011D6YX.upload.maximum_size=32768
GenC0.menu.pnum.GENERIC_C011D6YX.upload.maximum_data_size=6144
GenC0.menu.pnum.GENERIC_C011D6YX.build.board=GENERIC_C011D6YX
GenC0.menu.pnum.GENERIC_C011D6YX.build.product_line=STM32C011xx
GenC0.menu.pnum.GENERIC_C011D6YX.build.variant=STM32C0xx/C011D6Y_C011F(4-6)(P-U)_C031F(4-6)P

# Generic C011F4Px
GenC0.menu.pnum.GENERIC_C011F4PX=Generic C011F4Px
GenC0.menu.pnum.GENERIC_C011F4PX.upload.maximum_size=16384
GenC0.menu.pnum.GENERIC_C011F4PX.upload.maximum_data_size=6144
GenC0.menu.pnum.GENERIC_C011F4PX.build.board=GENERIC_C011F4PX
GenC0.menu.pnum.GENERIC_C011F4PX.build.product_line=STM32C011xx
GenC0.menu.pnum.GENERIC_C011F4PX.build.variant=STM32C0xx/C011D6Y_C011F(4-6)(P-U)_C031F(4-6)P

# Generic C011F6Px
GenC0.menu.pnum.GENERIC_C011F6PX=Generic C011F6Px
GenC0.menu.pnum.GENERIC_C011F6PX.upload.maximum_size=32768
GenC0.menu.pnum.GENERIC_C011F6PX.upload.maximum_data_size=6144
GenC0.menu.pnum.GENERIC_C011F6PX.build.board=GENERIC_C011F6PX
GenC0.menu.pnum.GENERIC_C011F6PX.build.product_line=STM32C011xx
GenC0.menu.pnum.GENERIC_C011F6PX.build.variant=STM32C0xx/C011D6Y_C011F(4-6)(P-U)_C031F(4-6)P

# Generic C011F4Ux
GenC0.menu.pnum.GENERIC_C011F4UX=Generic C011F4Ux
GenC0.menu.pnum.GENERIC_C011F4UX.upload.maximum_size=16384
GenC0.menu.pnum.GENERIC_C011F4UX.upload.maximum_data_size=6144
GenC0.menu.pnum.GENERIC_C011F4UX.build.board=GENERIC_C011F4UX
GenC0.menu.pnum.GENERIC_C011F4UX.build.product_line=STM32C011xx
GenC0.menu.pnum.GENERIC_C011F4UX.build.variant=STM32C0xx/C011D6Y_C011F(4-6)(P-U)_C031F(4-6)P

# Generic C011F6Ux
GenC0.menu.pnum.GENERIC_C011F6UX=Generic C011F6Ux
GenC0.menu.pnum.GENERIC_C011F6UX.upload.maximum_size=32768
GenC0.menu.pnum.GENERIC_C011F6UX.upload.maximum_data_size=6144
GenC0.menu.pnum.GENERIC_C011F6UX.build.board=GENERIC_C011F6UX
GenC0.menu.pnum.GENERIC_C011F6UX.build.product_line=STM32C011xx
GenC0.menu.pnum.GENERIC_C011F6UX.build.variant=STM32C0xx/C011D6Y_C011F(4-6)(P-U)_C031F(4-6)P

# Generic C031C4Tx
GenC0.menu.pnum.GENERIC_C031C4TX=Generic C031C4Tx
GenC0.menu.pnum.GENERIC_C031C4TX.upload.maximum_size=16384
GenC0.menu.pnum.GENERIC_C031C4TX.upload.maximum_data_size=12288
GenC0.menu.pnum.GENERIC_C031C4TX.build.board=GENERIC_C031C4TX
GenC0.menu.pnum.GENERIC_C031C4TX.build.product_line=STM32C031xx
GenC0.menu.pnum.GENERIC_C031C4TX.build.variant=STM32C0xx/C031C(4-6)(T-U)

# Generic C031C6Tx
GenC0.menu.pnum.GENERIC_C031C6TX=Generic C031C6Tx
GenC0.menu.pnum.GENERIC_C031C6TX.upload.maximum_size=32768
GenC0.menu.pnum.GENERIC_C031C6TX.upload.maximum_data_size=12288
GenC0.menu.pnum.GENERIC_C031C6TX.build.board=GENERIC_C031C6TX
GenC0.menu.pnum.GENERIC_C031C6TX.build.product_line=STM32C031xx
GenC0.menu.pnum.GENERIC_C031C6TX.build.variant=STM32C0xx/C031C(4-6)(T-U)

# Generic C031C4Ux
GenC0.menu.pnum.GENERIC_C031C4UX=Generic C031C4Ux
GenC0.menu.pnum.GENERIC_C031C4UX.upload.maximum_size=16384
GenC0.menu.pnum.GENERIC_C031C4UX.upload.maximum_data_size=12288
GenC0.menu.pnum.GENERIC_C031C4UX.build.board=GENERIC_C031C4UX
GenC0.menu.pnum.GENERIC_C031C4UX.build.product_line=STM32C031xx
GenC0.menu.pnum.GENERIC_C031C4UX.build.variant=STM32C0xx/C031C(4-6)(T-U)

# Generic C031C6Ux
GenC0.menu.pnum.GENERIC_C031C6UX=Generic C031C6Ux
GenC0.menu.pnum.GENERIC_C031C6UX.upload.maximum_size=32768
GenC0.menu.pnum.GENERIC_C031C6UX.upload.maximum_data_size=12288
GenC0.menu.pnum.GENERIC_C031C6UX.build.board=GENERIC_C031C6UX
GenC0.menu.pnum.GENERIC_C031C6UX.build.product_line=STM32C031xx
GenC0.menu.pnum.GENERIC_C031C6UX.build.variant=STM32C0xx/C031C(4-6)(T-U)

# Generic C031F4Px
GenC0.menu.pnum.GENERIC_C031F4PX=Generic C031F4Px
GenC0.menu.pnum.GENERIC_C031F4PX.upload.maximum_size=16384
GenC0.menu.pnum.GENERIC_C031F4PX.upload.maximum_data_size=12288
GenC0.menu.pnum.GENERIC_C031F4PX.build.board=GENERIC_C031F4PX
GenC0.menu.pnum.GENERIC_C031F4PX.build.product_line=STM32C031xx
GenC0.menu.pnum.GENERIC_C031F4PX.build.variant=STM32C0xx/C011D6Y_C011F(4-6)(P-U)_C031F(4-6)P

