chcbaram/CODING_SOGUL_STM32/boards.txt
# Generic F042F6Px
GenF0.menu.pnum.GENERIC_F042F6PX=Generic F042F6Px
GenF0.menu.pnum.GENERIC_F042F6PX.upload.maximum_size=32768
GenF0.menu.pnum.GENERIC_F042F6PX.upload.maximum_data_size=6144
GenF0.menu.pnum.GENERIC_F042F6PX.build.board=GENERIC_F042F6PX
GenF0.menu.pnum.GENERIC_F042F6PX.build.product_line=STM32F042x6
GenF0.menu.pnum.GENERIC_F042F6PX.build.variant=STM32F0xx/F042F(4-6)P

# Generic F042G4Ux
GenF0.menu.pnum.GENERIC_F042G4UX=Generic F042G4Ux
GenF0.menu.pnum.GENERIC_F042G4UX.upload.maximum_size=16384
GenF0.menu.pnum.GENERIC_F042G4UX.upload.maximum_data_size=6144
GenF0.menu.pnum.GENERIC_F042G4UX.build.board=GENERIC_F042G4UX
GenF0.menu.pnum.GENERIC_F042G4UX.build.product_line=STM32F042x6
GenF0.menu.pnum.GENERIC_F042G4UX.build.variant=STM32F0xx/F042G(4-6)U

# Generic F042G6Ux
GenF0.menu.pnum.GENERIC_F042G6UX=Generic F042G6Ux
GenF0.menu.pnum.GENERIC_F042G6UX.upload.maximum_size=32768
GenF0.menu.pnum.GENERIC_F042G6UX.upload.maximum_data_size=6144
GenF0.menu.pnum.GENERIC_F042G6UX.build.board=GENERIC_F042G6UX
GenF0.menu.pnum.GENERIC_F042G6UX.build.product_line=STM32F042x6
GenF0.menu.pnum.GENERIC_F042G6UX.build.variant=STM32F0xx/F042G(4-6)U

# Generic F042K4Tx
GenF0.menu.pnum.GENERIC_F042K4TX=Generic F042K4Tx
GenF0.menu.pnum.GENERIC_F042K4TX.upload.maximum_size=16384
GenF0.menu.pnum.GENERIC_F042K4TX.upload.maximum_data_size=6144
GenF0.menu.pnum.GENERIC_F042K4TX.build.board=GENERIC_F042K4TX
GenF0.menu.pnum.GENERIC_F042K4TX.build.product_line=STM32F042x6
GenF0.menu.pnum.GENERIC_F042K4TX.build.variant=STM32F0xx/F042K(4-6)T

# Generic F042K6Tx
GenF0.menu.pnum.GENERIC_F042K6TX=Generic F042K6Tx
GenF0.menu.pnum.GENERIC_F042K6TX.upload.maximum_size=32768
GenF0.menu.pnum.GENERIC_F042K6TX.upload.maximum_data_size=6144
GenF0.menu.pnum.GENERIC_F042K6TX.build.board=GENERIC_F042K6TX
GenF0.menu.pnum.GENERIC_F042K6TX.build.product_line=STM32F042x6
GenF0.menu.pnum.GENERIC_F042K6TX.build.variant=STM32F0xx/F042K(4-6)T

# Generic F042T6Yx
GenF0.menu.pnum.GENERIC_F042T6YX=Generic F042T6Yx
GenF0.menu.pnum.GENERIC_F042T6YX.upload.maximum_size=32768
GenF0.menu.pnum.GENERIC_F042T6YX.upload.maximum_data_size=6144
GenF0.menu.pnum.GENERIC_F042T6YX.build.board=GENERIC_F042T6YX
GenF0.menu.pnum.GENERIC_F042T6YX.build.product_line=STM32F042x6
GenF0.menu.pnum.GENERIC_F042T6YX.build.variant=STM32F0xx/F042T6Y

# Generic F048G6Ux
GenF0.menu.pnum.GENERIC_F048G6UX=Generic F048G6Ux
GenF0.menu.pnum.GENERIC_F048G6UX.upload.maximum_size=32768
GenF0.menu.pnum.GENERIC_F048G6UX.upload.maximum_data_size=6144
GenF0.menu.pnum.GENERIC_F048G6UX.build.board=GENERIC_F048G6UX
GenF0.menu.pnum.GENERIC_F048G6UX.build.product_line=STM32F048xx
GenF0.menu.pnum.GENERIC_F048G6UX.build.variant=STM32F0xx/F048G6U

# Generic F048T6Yx
GenF0.menu.pnum.GENERIC_F048T6YX=Generic F048T6Yx
GenF0.menu.pnum.GENERIC_F048T6YX.upload.maximum_size=32768
GenF0.menu.pnum.GENERIC_F048T6YX.upload.maximum_data_size=6144
GenF0.menu.pnum.GENERIC_F048T6YX.build.board=GENERIC_F048T6YX
GenF0.menu.pnum.GENERIC_F048T6YX.build.product_line=STM32F048xx
GenF0.menu.pnum.GENERIC_F048T6YX.build.variant=STM32F0xx/F048T6Y

# Generic F051C4Tx
GenF0.menu.pnum.GENERIC_F051C4TX=Generic F051C4Tx
GenF0.menu.pnum.GENERIC_F051C4TX.upload.maximum_size=16384
GenF0.menu.pnum.GENERIC_F051C4TX.upload.maximum_data_size=8192
GenF0.menu.pnum.GENERIC_F051C4TX.build.board=GENERIC_F051C4TX
GenF0.menu.pnum.GENERIC_F051C4TX.build.product_line=STM32F051x8
GenF0.menu.pnum.GENERIC_F051C4TX.build.variant=STM32F0xx/F051C4(T-U)

# Generic F051C4Ux
GenF0.menu.pnum.GENERIC_F051C4UX=Generic F051C4Ux
GenF0.menu.pnum.GENERIC_F051C4UX.upload.maximum_size=16384
GenF0.menu.pnum.GENERIC_F051C4UX.upload.maximum_data_size=8192
GenF0.menu.pnum.GENERIC_F051C4UX.build.board=GENERIC_F051C4UX
GenF0.menu.pnum.GENERIC_F051C4UX.build.product_line=STM32F051x8
GenF0.menu.pnum.GENERIC_F051C4UX.build.variant=STM32F0xx/F051C4(T-U)

# Generic F051K4Tx
GenF0.menu.pnum.GENERIC_F051K4TX=Generic F051K4Tx
GenF0.menu.pnum.GENERIC_F051K4TX.upload.maximum_size=16384
GenF0.menu.pnum.GENERIC_F051K4TX.upload.maximum_data_size=8192
GenF0.menu.pnum.GENERIC_F051K4TX.build.board=GENERIC_F051K4TX
GenF0.menu.pnum.GENERIC_F051K4TX.build.product_line=STM32F051x8
GenF0.menu.pnum.GENERIC_F051K4TX.build.variant=STM32F0xx/F051K4T

# Generic F051K6Ux
GenF0.menu.pnum.GENERIC_F051K6UX=Generic F051K6Ux
GenF0.menu.pnum.GENERIC_F051K6UX.upload.maximum_size=32768
GenF0.menu.pnum.GENERIC_F051K6UX.upload.maximum_data_size=8192
GenF0.menu.pnum.GENERIC_F051K6UX.build.board=GENERIC_F051K6UX
GenF0.menu.pnum.GENERIC_F051K6UX.build.product_line=STM32F051x8
GenF0.menu.pnum.GENERIC_F051K6UX.build.variant=STM32F0xx/F051K(6-8)U

# Generic F051K8Ux
GenF0.menu.pnum.GENERIC_F051K8UX=Generic F051K8Ux
GenF0.menu.pnum.GENERIC_F051K8UX.upload.maximum_size=65536
GenF0.menu.pnum.GENERIC_F051K8UX.upload.maximum_data_size=8192
GenF0.menu.pnum.GENERIC_F051K8UX.build.board=GENERIC_F051K8UX
GenF0.menu.pnum.GENERIC_F051K8UX.build.product_line=STM32F051x8
GenF0.menu.pnum.GENERIC_F051K8UX.build.variant=STM32F0xx/F051K(6-8)U

# Generic F051R4Tx
GenF0.menu.pnum.GENERIC_F051R4TX=Generic F051R4Tx
GenF0.menu.pnum.GENERIC_F051R4TX.upload.maximum_size=16384
GenF0.menu.pnum.GENERIC_F051R4TX.upload.maximum_data_size=8192
GenF0.menu.pnum.GENERIC_F051R4TX.build.board=GENERIC_F051R4TX
GenF0.menu.pnum.GENERIC_F051R4TX.build.product_line=STM32F051x8
GenF0.menu.pnum.GENERIC_F051R4TX.build.variant=STM32F0xx/F051R4T

# Generic F051T8Yx
GenF0.menu.pnum.GENERIC_F051T8YX=Generic F051T8Yx
GenF0.menu.pnum.GENERIC_F051T8YX.upload.maximum_size=65536
GenF0.menu.pnum.GENERIC_F051T8YX.upload.maximum_data_size=8192
GenF0.menu.pnum.GENERIC_F051T8YX.build.board=GENERIC_F051T8YX
GenF0.menu.pnum.GENERIC_F051T8YX.build.product_line=STM32F051x8
GenF0.menu.pnum.GENERIC_F051T8YX.build.variant=STM32F0xx/F051T8Y

# Generic F058C8Ux
GenF0.menu.pnum.GENERIC_F058C8UX=Generic F058C8Ux
GenF0.menu.pnum.GENERIC_F058C8UX.upload.maximum_size=65536
GenF0.menu.pnum.GENERIC_F058C8UX.upload.maximum_data_size=8192
GenF0.menu.pnum.GENERIC_F058C8UX.build.board=GENERIC_F058C8UX
GenF0.menu.pnum.GENERIC_F058C8UX.build.product_line=STM32F058xx
GenF0.menu.pnum.GENERIC_F058C8UX.build.variant=STM32F0xx/F058C8U

# Generic F058R8Hx
GenF0.menu.pnum.GENERIC_F058R8HX=Generic F058R8Hx
GenF0.menu.pnum.GENERIC_F058R8HX.upload.maximum_size=65536
GenF0.menu.pnum.GENERIC_F058R8HX.upload.maximum_data_size=8192
GenF0.menu.pnum.GENERIC_F058R8HX.build.board=GENERIC_F058R8HX
GenF0.menu.pnum.GENERIC_F058R8HX.build.product_line=STM32F058xx
GenF0.menu.pnum.GENERIC_F058R8HX.build.variant=STM32F0xx/F058R8(H-T)

# Generic F058R8Tx
GenF0.menu.pnum.GENERIC_F058R8TX=Generic F058R8Tx
GenF0.menu.pnum.GENERIC_F058R8TX.upload.maximum_size=65536
GenF0.menu.pnum.GENERIC_F058R8TX.upload.maximum_data_size=8192
GenF0.menu.pnum.GENERIC_F058R8TX.build.board=GENERIC_F058R8TX
GenF0.menu.pnum.GENERIC_F058R8TX.build.product_line=STM32F058xx
GenF0.menu.pnum.GENERIC_F058R8TX.build.variant=STM32F0xx/F058R8(H-T)

# Generic F058T8Yx
GenF0.menu.pnum.GENERIC_F058T8YX=Generic F058T8Yx
GenF0.menu.pnum.GENERIC_F058T8YX.upload.maximum_size=65536
GenF0.menu.pnum.GENERIC_F058T8YX.upload.maximum_data_size=8192
GenF0.menu.pnum.GENERIC_F058T8YX.build.board=GENERIC_F058T8YX
GenF0.menu.pnum.GENERIC_F058T8YX.build.product_line=STM32F058xx
GenF0.menu.pnum.GENERIC_F058T8YX.build.variant=STM32F0xx/F058T8Y

