chcbaram/CODING_SOGUL_STM32/boards.txt
# Generic F072R8Tx
GenF0.menu.pnum.GENERIC_F072R8TX=Generic F072R8Tx
GenF0.menu.pnum.GENERIC_F072R8TX.upload.maximum_size=65536
GenF0.menu.pnum.GENERIC_F072R8TX.upload.maximum_data_size=16384
GenF0.menu.pnum.GENERIC_F072R8TX.build.board=GENERIC_F072R8TX
GenF0.menu.pnum.GENERIC_F072R8TX.build.product_line=STM32F072xB
GenF0.menu.pnum.GENERIC_F072R8TX.build.variant=STM32F0xx/F072R8T_F072RB(H-I-T)

# Generic F072RBTx
GenF0.menu.pnum.GENERIC_F072RBTX=Generic F072RBTx
GenF0.menu.pnum.GENERIC_F072RBTX.upload.maximum_size=131072
GenF0.menu.pnum.GENERIC_F072RBTX.upload.maximum_data_size=16384
GenF0.menu.pnum.GENERIC_F072RBTX.build.board=GENERIC_F072RBTX
GenF0.menu.pnum.GENERIC_F072RBTX.build.product_line=STM32F072xB
GenF0.menu.pnum.GENERIC_F072RBTX.build.variant=STM32F0xx/F072R8T_F072RB(H-I-T)

# Generic F072RBHx
GenF0.menu.pnum.GENERIC_F072RBHX=Generic F072RBHx
GenF0.menu.pnum.GENERIC_F072RBHX.upload.maximum_size=131072
GenF0.menu.pnum.GENERIC_F072RBHX.upload.maximum_data_size=16384
GenF0.menu.pnum.GENERIC_F072RBHX.build.board=GENERIC_F072RBHX
GenF0.menu.pnum.GENERIC_F072RBHX.build.product_line=STM32F072xB
GenF0.menu.pnum.GENERIC_F072RBHX.build.variant=STM32F0xx/F072R8T_F072RB(H-I-T)

# Generic F072RBIx
GenF0.menu.pnum.GENERIC_F072RBIX=Generic F072RBIx
GenF0.menu.pnum.GENERIC_F072RBIX.upload.maximum_size=131072
GenF0.menu.pnum.GENERIC_F072RBIX.upload.maximum_data_size=16384
GenF0.menu.pnum.GENERIC_F072RBIX.build.board=GENERIC_F072RBIX
GenF0.menu.pnum.GENERIC_F072RBIX.build.product_line=STM32F072xB
GenF0.menu.pnum.GENERIC_F072RBIX.build.variant=STM32F0xx/F072R8T_F072RB(H-I-T)

# Generic F072V8Hx
GenF0.menu.pnum.GENERIC_F072V8HX=Generic F072V8Hx
GenF0.menu.pnum.GENERIC_F072V8HX.upload.maximum_size=65536
GenF0.menu.pnum.GENERIC_F072V8HX.upload.maximum_data_size=16384
GenF0.menu.pnum.GENERIC_F072V8HX.build.board=GENERIC_F072V8HX
GenF0.menu.pnum.GENERIC_F072V8HX.build.product_line=STM32F072xB
GenF0.menu.pnum.GENERIC_F072V8HX.build.variant=STM32F0xx/F072V(8-B)(H-T)

# Generic F072VBHx
GenF0.menu.pnum.GENERIC_F072VBHX=Generic F072VBHx
GenF0.menu.pnum.GENERIC_F072VBHX.upload.maximum_size=131072
GenF0.menu.pnum.GENERIC_F072VBHX.upload.maximum_data_size=16384
GenF0.menu.pnum.GENERIC_F072VBHX.build.board=GENERIC_F072VBHX
GenF0.menu.pnum.GENERIC_F072VBHX.build.product_line=STM32F072xB
GenF0.menu.pnum.GENERIC_F072VBHX.build.variant=STM32F0xx/F072V(8-B)(H-T)

# Generic F072V8Tx
GenF0.menu.pnum.GENERIC_F072V8TX=Generic F072V8Tx
GenF0.menu.pnum.GENERIC_F072V8TX.upload.maximum_size=65536
GenF0.menu.pnum.GENERIC_F072V8TX.upload.maximum_data_size=16384
GenF0.menu.pnum.GENERIC_F072V8TX.build.board=GENERIC_F072V8TX
GenF0.menu.pnum.GENERIC_F072V8TX.build.product_line=STM32F072xB
GenF0.menu.pnum.GENERIC_F072V8TX.build.variant=STM32F0xx/F072V(8-B)(H-T)

# Generic F072VBTx
GenF0.menu.pnum.GENERIC_F072VBTX=Generic F072VBTx
GenF0.menu.pnum.GENERIC_F072VBTX.upload.maximum_size=131072
GenF0.menu.pnum.GENERIC_F072VBTX.upload.maximum_data_size=16384
GenF0.menu.pnum.GENERIC_F072VBTX.build.board=GENERIC_F072VBTX
GenF0.menu.pnum.GENERIC_F072VBTX.build.product_line=STM32F072xB
GenF0.menu.pnum.GENERIC_F072VBTX.build.variant=STM32F0xx/F072V(8-B)(H-T)

# Generic F078CBTx
GenF0.menu.pnum.GENERIC_F078CBTX=Generic F078CBTx
GenF0.menu.pnum.GENERIC_F078CBTX.upload.maximum_size=131072
GenF0.menu.pnum.GENERIC_F078CBTX.upload.maximum_data_size=16384
GenF0.menu.pnum.GENERIC_F078CBTX.build.board=GENERIC_F078CBTX
GenF0.menu.pnum.GENERIC_F078CBTX.build.product_line=STM32F078xx
GenF0.menu.pnum.GENERIC_F078CBTX.build.variant=STM32F0xx/F078CB(T-U-Y)

# Generic F078CBUx
GenF0.menu.pnum.GENERIC_F078CBUX=Generic F078CBUx
GenF0.menu.pnum.GENERIC_F078CBUX.upload.maximum_size=131072
GenF0.menu.pnum.GENERIC_F078CBUX.upload.maximum_data_size=16384
GenF0.menu.pnum.GENERIC_F078CBUX.build.board=GENERIC_F078CBUX
GenF0.menu.pnum.GENERIC_F078CBUX.build.product_line=STM32F078xx
GenF0.menu.pnum.GENERIC_F078CBUX.build.variant=STM32F0xx/F078CB(T-U-Y)

# Generic F078CBYx
GenF0.menu.pnum.GENERIC_F078CBYX=Generic F078CBYx
GenF0.menu.pnum.GENERIC_F078CBYX.upload.maximum_size=131072
GenF0.menu.pnum.GENERIC_F078CBYX.upload.maximum_data_size=16384
GenF0.menu.pnum.GENERIC_F078CBYX.build.board=GENERIC_F078CBYX
GenF0.menu.pnum.GENERIC_F078CBYX.build.product_line=STM32F078xx
GenF0.menu.pnum.GENERIC_F078CBYX.build.variant=STM32F0xx/F078CB(T-U-Y)

# Generic F078RBHx
GenF0.menu.pnum.GENERIC_F078RBHX=Generic F078RBHx
GenF0.menu.pnum.GENERIC_F078RBHX.upload.maximum_size=131072
GenF0.menu.pnum.GENERIC_F078RBHX.upload.maximum_data_size=16384
GenF0.menu.pnum.GENERIC_F078RBHX.build.board=GENERIC_F078RBHX
GenF0.menu.pnum.GENERIC_F078RBHX.build.product_line=STM32F078xx
GenF0.menu.pnum.GENERIC_F078RBHX.build.variant=STM32F0xx/F078RB(H-T)

# Generic F078RBTx
GenF0.menu.pnum.GENERIC_F078RBTX=Generic F078RBTx
GenF0.menu.pnum.GENERIC_F078RBTX.upload.maximum_size=131072
GenF0.menu.pnum.GENERIC_F078RBTX.upload.maximum_data_size=16384
GenF0.menu.pnum.GENERIC_F078RBTX.build.board=GENERIC_F078RBTX
GenF0.menu.pnum.GENERIC_F078RBTX.build.product_line=STM32F078xx
GenF0.menu.pnum.GENERIC_F078RBTX.build.variant=STM32F0xx/F078RB(H-T)

# Generic F078VBHx
GenF0.menu.pnum.GENERIC_F078VBHX=Generic F078VBHx
GenF0.menu.pnum.GENERIC_F078VBHX.upload.maximum_size=131072
GenF0.menu.pnum.GENERIC_F078VBHX.upload.maximum_data_size=16384
GenF0.menu.pnum.GENERIC_F078VBHX.build.board=GENERIC_F078VBHX
GenF0.menu.pnum.GENERIC_F078VBHX.build.product_line=STM32F078xx
GenF0.menu.pnum.GENERIC_F078VBHX.build.variant=STM32F0xx/F078VB(H-T)

# Generic F078VBTx
GenF0.menu.pnum.GENERIC_F078VBTX=Generic F078VBTx
GenF0.menu.pnum.GENERIC_F078VBTX.upload.maximum_size=131072
GenF0.menu.pnum.GENERIC_F078VBTX.upload.maximum_data_size=16384
GenF0.menu.pnum.GENERIC_F078VBTX.build.board=GENERIC_F078VBTX
GenF0.menu.pnum.GENERIC_F078VBTX.build.product_line=STM32F078xx
GenF0.menu.pnum.GENERIC_F078VBTX.build.variant=STM32F0xx/F078VB(H-T)

# Generic F091CBTx
GenF0.menu.pnum.GENERIC_F091CBTX=Generic F091CBTx
GenF0.menu.pnum.GENERIC_F091CBTX.upload.maximum_size=131072
GenF0.menu.pnum.GENERIC_F091CBTX.upload.maximum_data_size=32768
GenF0.menu.pnum.GENERIC_F091CBTX.build.board=GENERIC_F091CBTX
GenF0.menu.pnum.GENERIC_F091CBTX.build.product_line=STM32F091xC
GenF0.menu.pnum.GENERIC_F091CBTX.build.variant=STM32F0xx/F091C(B-C)(T-U)

# Generic F091CCTx
GenF0.menu.pnum.GENERIC_F091CCTX=Generic F091CCTx
GenF0.menu.pnum.GENERIC_F091CCTX.upload.maximum_size=262144
GenF0.menu.pnum.GENERIC_F091CCTX.upload.maximum_data_size=32768
GenF0.menu.pnum.GENERIC_F091CCTX.build.board=GENERIC_F091CCTX
GenF0.menu.pnum.GENERIC_F091CCTX.build.product_line=STM32F091xC
GenF0.menu.pnum.GENERIC_F091CCTX.build.variant=STM32F0xx/F091C(B-C)(T-U)

# Generic F091CBUx
GenF0.menu.pnum.GENERIC_F091CBUX=Generic F091CBUx
GenF0.menu.pnum.GENERIC_F091CBUX.upload.maximum_size=131072
GenF0.menu.pnum.GENERIC_F091CBUX.upload.maximum_data_size=32768
GenF0.menu.pnum.GENERIC_F091CBUX.build.board=GENERIC_F091CBUX
GenF0.menu.pnum.GENERIC_F091CBUX.build.product_line=STM32F091xC
GenF0.menu.pnum.GENERIC_F091CBUX.build.variant=STM32F0xx/F091C(B-C)(T-U)

# Generic F091CCUx
GenF0.menu.pnum.GENERIC_F091CCUX=Generic F091CCUx
GenF0.menu.pnum.GENERIC_F091CCUX.upload.maximum_size=262144
GenF0.menu.pnum.GENERIC_F091CCUX.upload.maximum_data_size=32768
GenF0.menu.pnum.GENERIC_F091CCUX.build.board=GENERIC_F091CCUX
GenF0.menu.pnum.GENERIC_F091CCUX.build.product_line=STM32F091xC
GenF0.menu.pnum.GENERIC_F091CCUX.build.variant=STM32F0xx/F091C(B-C)(T-U)

# Generic F091RBTx
GenF0.menu.pnum.GENERIC_F091RBTX=Generic F091RBTx
GenF0.menu.pnum.GENERIC_F091RBTX.upload.maximum_size=131072
GenF0.menu.pnum.GENERIC_F091RBTX.upload.maximum_data_size=32768
GenF0.menu.pnum.GENERIC_F091RBTX.build.board=GENERIC_F091RBTX
GenF0.menu.pnum.GENERIC_F091RBTX.build.product_line=STM32F091xC
GenF0.menu.pnum.GENERIC_F091RBTX.build.variant=STM32F0xx/F091RBT_F091RC(H-T-Y)

# Generic F091RCTx
GenF0.menu.pnum.GENERIC_F091RCTX=Generic F091RCTx
GenF0.menu.pnum.GENERIC_F091RCTX.upload.maximum_size=262144
GenF0.menu.pnum.GENERIC_F091RCTX.upload.maximum_data_size=32768
GenF0.menu.pnum.GENERIC_F091RCTX.build.board=GENERIC_F091RCTX
GenF0.menu.pnum.GENERIC_F091RCTX.build.product_line=STM32F091xC
GenF0.menu.pnum.GENERIC_F091RCTX.build.variant=STM32F0xx/F091RBT_F091RC(H-T-Y)

