chcbaram/CODING_SOGUL_STM32/boards.txt
# Generic F103VETx
GenF1.menu.pnum.GENERIC_F103VETX=Generic F103VETx
GenF1.menu.pnum.GENERIC_F103VETX.upload.maximum_size=524288
GenF1.menu.pnum.GENERIC_F103VETX.upload.maximum_data_size=65536
GenF1.menu.pnum.GENERIC_F103VETX.build.board=GENERIC_F103VETX
GenF1.menu.pnum.GENERIC_F103VETX.build.product_line=STM32F103xE
GenF1.menu.pnum.GENERIC_F103VETX.build.variant=STM32F1xx/F103V(C-D-E)(H-T)

# Generic F103VFTx
GenF1.menu.pnum.GENERIC_F103VFTX=Generic F103VFTx
GenF1.menu.pnum.GENERIC_F103VFTX.upload.maximum_size=786432
GenF1.menu.pnum.GENERIC_F103VFTX.upload.maximum_data_size=98304
GenF1.menu.pnum.GENERIC_F103VFTX.build.board=GENERIC_F103VFTX
GenF1.menu.pnum.GENERIC_F103VFTX.build.product_line=STM32F103xG
GenF1.menu.pnum.GENERIC_F103VFTX.build.variant=STM32F1xx/F103V(F-G)T

# Generic F103VGTx
GenF1.menu.pnum.GENERIC_F103VGTX=Generic F103VGTx
GenF1.menu.pnum.GENERIC_F103VGTX.upload.maximum_size=1048576
GenF1.menu.pnum.GENERIC_F103VGTX.upload.maximum_data_size=98304
GenF1.menu.pnum.GENERIC_F103VGTX.build.board=GENERIC_F103VGTX
GenF1.menu.pnum.GENERIC_F103VGTX.build.product_line=STM32F103xG
GenF1.menu.pnum.GENERIC_F103VGTX.build.variant=STM32F1xx/F103V(F-G)T

# Generic F103ZCHx
GenF1.menu.pnum.GENERIC_F103ZCHX=Generic F103ZCHx
GenF1.menu.pnum.GENERIC_F103ZCHX.upload.maximum_size=262144
GenF1.menu.pnum.GENERIC_F103ZCHX.upload.maximum_data_size=49152
GenF1.menu.pnum.GENERIC_F103ZCHX.build.board=GENERIC_F103ZCHX
GenF1.menu.pnum.GENERIC_F103ZCHX.build.product_line=STM32F103xE
GenF1.menu.pnum.GENERIC_F103ZCHX.build.variant=STM32F1xx/F103Z(C-D-E)(H-T)

# Generic F103ZDHx
GenF1.menu.pnum.GENERIC_F103ZDHX=Generic F103ZDHx
GenF1.menu.pnum.GENERIC_F103ZDHX.upload.maximum_size=393216
GenF1.menu.pnum.GENERIC_F103ZDHX.upload.maximum_data_size=65536
GenF1.menu.pnum.GENERIC_F103ZDHX.build.board=GENERIC_F103ZDHX
GenF1.menu.pnum.GENERIC_F103ZDHX.build.product_line=STM32F103xE
GenF1.menu.pnum.GENERIC_F103ZDHX.build.variant=STM32F1xx/F103Z(C-D-E)(H-T)

# Generic F103ZEHx
GenF1.menu.pnum.GENERIC_F103ZEHX=Generic F103ZEHx
GenF1.menu.pnum.GENERIC_F103ZEHX.upload.maximum_size=524288
GenF1.menu.pnum.GENERIC_F103ZEHX.upload.maximum_data_size=65536
GenF1.menu.pnum.GENERIC_F103ZEHX.build.board=GENERIC_F103ZEHX
GenF1.menu.pnum.GENERIC_F103ZEHX.build.product_line=STM32F103xE
GenF1.menu.pnum.GENERIC_F103ZEHX.build.variant=STM32F1xx/F103Z(C-D-E)(H-T)

# Generic F103ZCTx
GenF1.menu.pnum.GENERIC_F103ZCTX=Generic F103ZCTx
GenF1.menu.pnum.GENERIC_F103ZCTX.upload.maximum_size=262144
GenF1.menu.pnum.GENERIC_F103ZCTX.upload.maximum_data_size=49152
GenF1.menu.pnum.GENERIC_F103ZCTX.build.board=GENERIC_F103ZCTX
GenF1.menu.pnum.GENERIC_F103ZCTX.build.product_line=STM32F103xE
GenF1.menu.pnum.GENERIC_F103ZCTX.build.variant=STM32F1xx/F103Z(C-D-E)(H-T)

# Generic F103ZDTx
GenF1.menu.pnum.GENERIC_F103ZDTX=Generic F103ZDTx
GenF1.menu.pnum.GENERIC_F103ZDTX.upload.maximum_size=393216
GenF1.menu.pnum.GENERIC_F103ZDTX.upload.maximum_data_size=65536
GenF1.menu.pnum.GENERIC_F103ZDTX.build.board=GENERIC_F103ZDTX
GenF1.menu.pnum.GENERIC_F103ZDTX.build.product_line=STM32F103xE
GenF1.menu.pnum.GENERIC_F103ZDTX.build.variant=STM32F1xx/F103Z(C-D-E)(H-T)

# Generic F103ZETx
GenF1.menu.pnum.GENERIC_F103ZETX=Generic F103ZETx
GenF1.menu.pnum.GENERIC_F103ZETX.upload.maximum_size=524288
GenF1.menu.pnum.GENERIC_F103ZETX.upload.maximum_data_size=65536
GenF1.menu.pnum.GENERIC_F103ZETX.build.board=GENERIC_F103ZETX
GenF1.menu.pnum.GENERIC_F103ZETX.build.product_line=STM32F103xE
GenF1.menu.pnum.GENERIC_F103ZETX.build.variant=STM32F1xx/F103Z(C-D-E)(H-T)

# Generic F103ZFHx
GenF1.menu.pnum.GENERIC_F103ZFHX=Generic F103ZFHx
GenF1.menu.pnum.GENERIC_F103ZFHX.upload.maximum_size=786432
GenF1.menu.pnum.GENERIC_F103ZFHX.upload.maximum_data_size=98304
GenF1.menu.pnum.GENERIC_F103ZFHX.build.board=GENERIC_F103ZFHX
GenF1.menu.pnum.GENERIC_F103ZFHX.build.product_line=STM32F103xG
GenF1.menu.pnum.GENERIC_F103ZFHX.build.variant=STM32F1xx/F103Z(F-G)(H-T)

# Generic F103ZGHx
GenF1.menu.pnum.GENERIC_F103ZGHX=Generic F103ZGHx
GenF1.menu.pnum.GENERIC_F103ZGHX.upload.maximum_size=1048576
GenF1.menu.pnum.GENERIC_F103ZGHX.upload.maximum_data_size=98304
GenF1.menu.pnum.GENERIC_F103ZGHX.build.board=GENERIC_F103ZGHX
GenF1.menu.pnum.GENERIC_F103ZGHX.build.product_line=STM32F103xG
GenF1.menu.pnum.GENERIC_F103ZGHX.build.variant=STM32F1xx/F103Z(F-G)(H-T)

# Generic F103ZFTx
GenF1.menu.pnum.GENERIC_F103ZFTX=Generic F103ZFTx
GenF1.menu.pnum.GENERIC_F103ZFTX.upload.maximum_size=786432
GenF1.menu.pnum.GENERIC_F103ZFTX.upload.maximum_data_size=98304
GenF1.menu.pnum.GENERIC_F103ZFTX.build.board=GENERIC_F103ZFTX
GenF1.menu.pnum.GENERIC_F103ZFTX.build.product_line=STM32F103xG
GenF1.menu.pnum.GENERIC_F103ZFTX.build.variant=STM32F1xx/F103Z(F-G)(H-T)

# Generic F103ZGTx
GenF1.menu.pnum.GENERIC_F103ZGTX=Generic F103ZGTx
GenF1.menu.pnum.GENERIC_F103ZGTX.upload.maximum_size=1048576
GenF1.menu.pnum.GENERIC_F103ZGTX.upload.maximum_data_size=98304
GenF1.menu.pnum.GENERIC_F103ZGTX.build.board=GENERIC_F103ZGTX
GenF1.menu.pnum.GENERIC_F103ZGTX.build.product_line=STM32F103xG
GenF1.menu.pnum.GENERIC_F103ZGTX.build.variant=STM32F1xx/F103Z(F-G)(H-T)

# Upload menu
GenF1.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenF1.menu.upload_method.swdMethod.upload.protocol=0
GenF1.menu.upload_method.swdMethod.upload.options=
GenF1.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenF1.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenF1.menu.upload_method.serialMethod.upload.protocol=1
GenF1.menu.upload_method.serialMethod.upload.options={serial.port.file}
GenF1.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenF1.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenF1.menu.upload_method.dfuMethod.upload.protocol=2
GenF1.menu.upload_method.dfuMethod.upload.options=
GenF1.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

GenF1.menu.upload_method.bmpMethod=BMP (Black Magic Probe)
GenF1.menu.upload_method.bmpMethod.upload.protocol=gdb_bmp
GenF1.menu.upload_method.bmpMethod.upload.tool=bmp_upload

