chcbaram/CODING_SOGUL_STM32/boards.txt
GenF1.menu.upload_method.hidMethod=HID Bootloader 2.2
GenF1.menu.upload_method.hidMethod.upload.protocol=hid22
GenF1.menu.upload_method.hidMethod.upload.tool=hid_upload
GenF1.menu.upload_method.hidMethod.build.flash_offset=0x800
GenF1.menu.upload_method.hidMethod.build.bootloader_flags=-DBL_HID

GenF1.menu.upload_method.dfu2Method=Maple DFU Bootloader 2.0
GenF1.menu.upload_method.dfu2Method.upload.protocol=maple
GenF1.menu.upload_method.dfu2Method.upload.tool=maple_upload
GenF1.menu.upload_method.dfu2Method.upload.usbID=1EAF:0003
GenF1.menu.upload_method.dfu2Method.upload.altID=2
GenF1.menu.upload_method.dfu2Method.build.flash_offset=0x2000
GenF1.menu.upload_method.dfu2Method.build.bootloader_flags=-DBL_LEGACY_LEAF

GenF1.menu.upload_method.dfuoMethod=Maple DFU Bootloader original
GenF1.menu.upload_method.dfuoMethod.upload.protocol=maple
GenF1.menu.upload_method.dfuoMethod.upload.tool=maple_upload
GenF1.menu.upload_method.dfuoMethod.upload.usbID=1EAF:0003
GenF1.menu.upload_method.dfuoMethod.upload.altID=1
GenF1.menu.upload_method.dfuoMethod.build.flash_offset=0x5000
GenF1.menu.upload_method.dfuoMethod.build.bootloader_flags=-DBL_LEGACY_LEAF

################################################################################
# Generic F2
GenF2.name=Generic STM32F2 series

GenF2.build.core=arduino
GenF2.build.board=GenF2
GenF2.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
GenF2.build.mcu=cortex-m3
GenF2.build.series=STM32F2xx
GenF2.build.cmsis_lib_gcc=arm_cortexM3l_math
GenF2.build.flash_offset=0x0
GenF2.upload.maximum_size=0
GenF2.upload.maximum_data_size=0

# Generic F205RBTx
GenF2.menu.pnum.GENERIC_F205RBTX=Generic F205RBTx
GenF2.menu.pnum.GENERIC_F205RBTX.upload.maximum_size=131072
GenF2.menu.pnum.GENERIC_F205RBTX.upload.maximum_data_size=65536
GenF2.menu.pnum.GENERIC_F205RBTX.build.board=GENERIC_F205RBTX
GenF2.menu.pnum.GENERIC_F205RBTX.build.product_line=STM32F205xx
GenF2.menu.pnum.GENERIC_F205RBTX.build.variant=STM32F2xx/F205RE(T-Y)_F205R(B-C-F)T_F205RG(E-T-Y)_F215R(E-G)T

# Generic F205RCTx
GenF2.menu.pnum.GENERIC_F205RCTX=Generic F205RCTx
GenF2.menu.pnum.GENERIC_F205RCTX.upload.maximum_size=262144
GenF2.menu.pnum.GENERIC_F205RCTX.upload.maximum_data_size=98304
GenF2.menu.pnum.GENERIC_F205RCTX.build.board=GENERIC_F205RCTX
GenF2.menu.pnum.GENERIC_F205RCTX.build.product_line=STM32F205xx
GenF2.menu.pnum.GENERIC_F205RCTX.build.variant=STM32F2xx/F205RE(T-Y)_F205R(B-C-F)T_F205RG(E-T-Y)_F215R(E-G)T

# Generic F205RETx
GenF2.menu.pnum.GENERIC_F205RETX=Generic F205RETx
GenF2.menu.pnum.GENERIC_F205RETX.upload.maximum_size=524288
GenF2.menu.pnum.GENERIC_F205RETX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F205RETX.build.board=GENERIC_F205RETX
GenF2.menu.pnum.GENERIC_F205RETX.build.product_line=STM32F205xx
GenF2.menu.pnum.GENERIC_F205RETX.build.variant=STM32F2xx/F205RE(T-Y)_F205R(B-C-F)T_F205RG(E-T-Y)_F215R(E-G)T

# Generic F205RFTx
GenF2.menu.pnum.GENERIC_F205RFTX=Generic F205RFTx
GenF2.menu.pnum.GENERIC_F205RFTX.upload.maximum_size=786432
GenF2.menu.pnum.GENERIC_F205RFTX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F205RFTX.build.board=GENERIC_F205RFTX
GenF2.menu.pnum.GENERIC_F205RFTX.build.product_line=STM32F205xx
GenF2.menu.pnum.GENERIC_F205RFTX.build.variant=STM32F2xx/F205RE(T-Y)_F205R(B-C-F)T_F205RG(E-T-Y)_F215R(E-G)T

# Generic F205RGTx
GenF2.menu.pnum.GENERIC_F205RGTX=Generic F205RGTx
GenF2.menu.pnum.GENERIC_F205RGTX.upload.maximum_size=1048576
GenF2.menu.pnum.GENERIC_F205RGTX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F205RGTX.build.board=GENERIC_F205RGTX
GenF2.menu.pnum.GENERIC_F205RGTX.build.product_line=STM32F205xx
GenF2.menu.pnum.GENERIC_F205RGTX.build.variant=STM32F2xx/F205RE(T-Y)_F205R(B-C-F)T_F205RG(E-T-Y)_F215R(E-G)T

# Generic F205REYx
GenF2.menu.pnum.GENERIC_F205REYX=Generic F205REYx
GenF2.menu.pnum.GENERIC_F205REYX.upload.maximum_size=524288
GenF2.menu.pnum.GENERIC_F205REYX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F205REYX.build.board=GENERIC_F205REYX
GenF2.menu.pnum.GENERIC_F205REYX.build.product_line=STM32F205xx
GenF2.menu.pnum.GENERIC_F205REYX.build.variant=STM32F2xx/F205RE(T-Y)_F205R(B-C-F)T_F205RG(E-T-Y)_F215R(E-G)T

# Generic F205RGYx
GenF2.menu.pnum.GENERIC_F205RGYX=Generic F205RGYx
GenF2.menu.pnum.GENERIC_F205RGYX.upload.maximum_size=1048576
GenF2.menu.pnum.GENERIC_F205RGYX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F205RGYX.build.board=GENERIC_F205RGYX
GenF2.menu.pnum.GENERIC_F205RGYX.build.product_line=STM32F205xx
GenF2.menu.pnum.GENERIC_F205RGYX.build.variant=STM32F2xx/F205RE(T-Y)_F205R(B-C-F)T_F205RG(E-T-Y)_F215R(E-G)T

# Generic F205RGEx
GenF2.menu.pnum.GENERIC_F205RGEX=Generic F205RGEx
GenF2.menu.pnum.GENERIC_F205RGEX.upload.maximum_size=1048576
GenF2.menu.pnum.GENERIC_F205RGEX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F205RGEX.build.board=GENERIC_F205RGEX
GenF2.menu.pnum.GENERIC_F205RGEX.build.product_line=STM32F205xx
GenF2.menu.pnum.GENERIC_F205RGEX.build.variant=STM32F2xx/F205RE(T-Y)_F205R(B-C-F)T_F205RG(E-T-Y)_F215R(E-G)T

# Generic F205VBTx
GenF2.menu.pnum.GENERIC_F205VBTX=Generic F205VBTx
GenF2.menu.pnum.GENERIC_F205VBTX.upload.maximum_size=131072
GenF2.menu.pnum.GENERIC_F205VBTX.upload.maximum_data_size=65536
GenF2.menu.pnum.GENERIC_F205VBTX.build.board=GENERIC_F205VBTX
GenF2.menu.pnum.GENERIC_F205VBTX.build.product_line=STM32F205xx
GenF2.menu.pnum.GENERIC_F205VBTX.build.variant=STM32F2xx/F205V(B-C-E-F-G)T_F215V(E-G)T

# Generic F205VCTx
GenF2.menu.pnum.GENERIC_F205VCTX=Generic F205VCTx
GenF2.menu.pnum.GENERIC_F205VCTX.upload.maximum_size=262144
GenF2.menu.pnum.GENERIC_F205VCTX.upload.maximum_data_size=98304
GenF2.menu.pnum.GENERIC_F205VCTX.build.board=GENERIC_F205VCTX
GenF2.menu.pnum.GENERIC_F205VCTX.build.product_line=STM32F205xx
GenF2.menu.pnum.GENERIC_F205VCTX.build.variant=STM32F2xx/F205V(B-C-E-F-G)T_F215V(E-G)T

# Generic F205VETx
GenF2.menu.pnum.GENERIC_F205VETX=Generic F205VETx
GenF2.menu.pnum.GENERIC_F205VETX.upload.maximum_size=524288
GenF2.menu.pnum.GENERIC_F205VETX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F205VETX.build.board=GENERIC_F205VETX
GenF2.menu.pnum.GENERIC_F205VETX.build.product_line=STM32F205xx
GenF2.menu.pnum.GENERIC_F205VETX.build.variant=STM32F2xx/F205V(B-C-E-F-G)T_F215V(E-G)T

