chcbaram/CODING_SOGUL_STM32/boards.txt
# Generic F217VETx
GenF2.menu.pnum.GENERIC_F217VETX=Generic F217VETx
GenF2.menu.pnum.GENERIC_F217VETX.upload.maximum_size=524288
GenF2.menu.pnum.GENERIC_F217VETX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F217VETX.build.board=GENERIC_F217VETX
GenF2.menu.pnum.GENERIC_F217VETX.build.product_line=STM32F217xx
GenF2.menu.pnum.GENERIC_F217VETX.build.variant=STM32F2xx/F207V(C-E-F-G)T_F217V(E-G)T

# Generic F217VGTx
GenF2.menu.pnum.GENERIC_F217VGTX=Generic F217VGTx
GenF2.menu.pnum.GENERIC_F217VGTX.upload.maximum_size=1048576
GenF2.menu.pnum.GENERIC_F217VGTX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F217VGTX.build.board=GENERIC_F217VGTX
GenF2.menu.pnum.GENERIC_F217VGTX.build.product_line=STM32F217xx
GenF2.menu.pnum.GENERIC_F217VGTX.build.variant=STM32F2xx/F207V(C-E-F-G)T_F217V(E-G)T

# Generic F217ZETx
GenF2.menu.pnum.GENERIC_F217ZETX=Generic F217ZETx
GenF2.menu.pnum.GENERIC_F217ZETX.upload.maximum_size=524288
GenF2.menu.pnum.GENERIC_F217ZETX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F217ZETX.build.board=GENERIC_F217ZETX
GenF2.menu.pnum.GENERIC_F217ZETX.build.product_line=STM32F217xx
GenF2.menu.pnum.GENERIC_F217ZETX.build.variant=STM32F2xx/F207Z(C-E-F-G)T_F217Z(E-G)T

# Generic F217ZGTx
GenF2.menu.pnum.GENERIC_F217ZGTX=Generic F217ZGTx
GenF2.menu.pnum.GENERIC_F217ZGTX.upload.maximum_size=1048576
GenF2.menu.pnum.GENERIC_F217ZGTX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F217ZGTX.build.board=GENERIC_F217ZGTX
GenF2.menu.pnum.GENERIC_F217ZGTX.build.product_line=STM32F217xx
GenF2.menu.pnum.GENERIC_F217ZGTX.build.variant=STM32F2xx/F207Z(C-E-F-G)T_F217Z(E-G)T

# Upload menu
GenF2.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenF2.menu.upload_method.swdMethod.upload.protocol=0
GenF2.menu.upload_method.swdMethod.upload.options=
GenF2.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenF2.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenF2.menu.upload_method.serialMethod.upload.protocol=1
GenF2.menu.upload_method.serialMethod.upload.options={serial.port.file}
GenF2.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenF2.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenF2.menu.upload_method.dfuMethod.upload.protocol=2
GenF2.menu.upload_method.dfuMethod.upload.options=
GenF2.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

################################################################################
# Generic F3

GenF3.name=Generic STM32F3 series

GenF3.build.core=arduino
GenF3.build.board=GenF3
GenF3.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} {build.bootloader_flags}
GenF3.build.mcu=cortex-m4
GenF3.build.fpu=-mfpu=fpv4-sp-d16
GenF3.build.float-abi=-mfloat-abi=hard
GenF3.build.series=STM32F3xx
GenF3.build.cmsis_lib_gcc=arm_cortexM4lf_math
GenF3.build.flash_offset=0x0
GenF3.upload.maximum_size=0
GenF3.upload.maximum_data_size=0

# BLACKPILL_F303CC
GenF3.menu.pnum.BLACKPILL_F303CC=RobotDyn BlackPill F303CC
GenF3.menu.pnum.BLACKPILL_F303CC.upload.maximum_size=262144
GenF3.menu.pnum.BLACKPILL_F303CC.upload.maximum_data_size=40960
GenF3.menu.pnum.BLACKPILL_F303CC.build.board=BLACKPILL_F303CC
GenF3.menu.pnum.BLACKPILL_F303CC.build.product_line=STM32F303xC
GenF3.menu.pnum.BLACKPILL_F303CC.build.variant_h=variant_{build.board}.h
GenF3.menu.pnum.BLACKPILL_F303CC.build.variant=STM32F3xx/F303C(B-C)T

# OLIMEXINO_STM32F3
GenF3.menu.pnum.OLIMEXINO_STM32F3=OLIMEXINO-STM32F3
GenF3.menu.pnum.OLIMEXINO_STM32F3.upload.maximum_size=262144
GenF3.menu.pnum.OLIMEXINO_STM32F3.upload.maximum_data_size=40960
GenF3.menu.pnum.OLIMEXINO_STM32F3.build.board=OLIMEXINO_STM32F3
GenF3.menu.pnum.OLIMEXINO_STM32F3.build.product_line=STM32F303xC
GenF3.menu.pnum.OLIMEXINO_STM32F3.build.variant_h=variant_{build.board}.h
GenF3.menu.pnum.OLIMEXINO_STM32F3.build.variant=STM32F3xx/F303R(B-C)T

# Generic F301C6Tx
GenF3.menu.pnum.GENERIC_F301C6TX=Generic F301C6Tx
GenF3.menu.pnum.GENERIC_F301C6TX.upload.maximum_size=32768
GenF3.menu.pnum.GENERIC_F301C6TX.upload.maximum_data_size=16384
GenF3.menu.pnum.GENERIC_F301C6TX.build.board=GENERIC_F301C6TX
GenF3.menu.pnum.GENERIC_F301C6TX.build.product_line=STM32F301x8
GenF3.menu.pnum.GENERIC_F301C6TX.build.variant=STM32F3xx/F301C6T_F301C8(T-Y)

# Generic F301C8Tx
GenF3.menu.pnum.GENERIC_F301C8TX=Generic F301C8Tx
GenF3.menu.pnum.GENERIC_F301C8TX.upload.maximum_size=65536
GenF3.menu.pnum.GENERIC_F301C8TX.upload.maximum_data_size=16384
GenF3.menu.pnum.GENERIC_F301C8TX.build.board=GENERIC_F301C8TX
GenF3.menu.pnum.GENERIC_F301C8TX.build.product_line=STM32F301x8
GenF3.menu.pnum.GENERIC_F301C8TX.build.variant=STM32F3xx/F301C6T_F301C8(T-Y)

# Generic F301C8Yx
GenF3.menu.pnum.GENERIC_F301C8YX=Generic F301C8Yx
GenF3.menu.pnum.GENERIC_F301C8YX.upload.maximum_size=65536
GenF3.menu.pnum.GENERIC_F301C8YX.upload.maximum_data_size=16384
GenF3.menu.pnum.GENERIC_F301C8YX.build.board=GENERIC_F301C8YX
GenF3.menu.pnum.GENERIC_F301C8YX.build.product_line=STM32F301x8
GenF3.menu.pnum.GENERIC_F301C8YX.build.variant=STM32F3xx/F301C6T_F301C8(T-Y)

# Generic F301K6Tx
GenF3.menu.pnum.GENERIC_F301K6TX=Generic F301K6Tx
GenF3.menu.pnum.GENERIC_F301K6TX.upload.maximum_size=32768
GenF3.menu.pnum.GENERIC_F301K6TX.upload.maximum_data_size=16384
GenF3.menu.pnum.GENERIC_F301K6TX.build.board=GENERIC_F301K6TX
GenF3.menu.pnum.GENERIC_F301K6TX.build.product_line=STM32F301x8
GenF3.menu.pnum.GENERIC_F301K6TX.build.variant=STM32F3xx/F301K(6-8)T

# Generic F301K8Tx
GenF3.menu.pnum.GENERIC_F301K8TX=Generic F301K8Tx
GenF3.menu.pnum.GENERIC_F301K8TX.upload.maximum_size=65536
GenF3.menu.pnum.GENERIC_F301K8TX.upload.maximum_data_size=16384
GenF3.menu.pnum.GENERIC_F301K8TX.build.board=GENERIC_F301K8TX
GenF3.menu.pnum.GENERIC_F301K8TX.build.product_line=STM32F301x8
GenF3.menu.pnum.GENERIC_F301K8TX.build.variant=STM32F3xx/F301K(6-8)T

# Generic F301R6Tx
GenF3.menu.pnum.GENERIC_F301R6TX=Generic F301R6Tx
GenF3.menu.pnum.GENERIC_F301R6TX.upload.maximum_size=32768
GenF3.menu.pnum.GENERIC_F301R6TX.upload.maximum_data_size=16384
GenF3.menu.pnum.GENERIC_F301R6TX.build.board=GENERIC_F301R6TX
GenF3.menu.pnum.GENERIC_F301R6TX.build.product_line=STM32F301x8
GenF3.menu.pnum.GENERIC_F301R6TX.build.variant=STM32F3xx/F301R(6-8)T

# Generic F301R8Tx
GenF3.menu.pnum.GENERIC_F301R8TX=Generic F301R8Tx
GenF3.menu.pnum.GENERIC_F301R8TX.upload.maximum_size=65536
GenF3.menu.pnum.GENERIC_F301R8TX.upload.maximum_data_size=16384
GenF3.menu.pnum.GENERIC_F301R8TX.build.board=GENERIC_F301R8TX
GenF3.menu.pnum.GENERIC_F301R8TX.build.product_line=STM32F301x8
GenF3.menu.pnum.GENERIC_F301R8TX.build.variant=STM32F3xx/F301R(6-8)T

# Generic F302R6Tx
GenF3.menu.pnum.GENERIC_F302R6TX=Generic F302R6Tx
GenF3.menu.pnum.GENERIC_F302R6TX.upload.maximum_size=32768
GenF3.menu.pnum.GENERIC_F302R6TX.upload.maximum_data_size=16384
GenF3.menu.pnum.GENERIC_F302R6TX.build.board=GENERIC_F302R6TX
GenF3.menu.pnum.GENERIC_F302R6TX.build.product_line=STM32F302x8
GenF3.menu.pnum.GENERIC_F302R6TX.build.variant=STM32F3xx/F302R(6-8)T

# Generic F302R8Tx
GenF3.menu.pnum.GENERIC_F302R8TX=Generic F302R8Tx
GenF3.menu.pnum.GENERIC_F302R8TX.upload.maximum_size=65536
GenF3.menu.pnum.GENERIC_F302R8TX.upload.maximum_data_size=16384
GenF3.menu.pnum.GENERIC_F302R8TX.build.board=GENERIC_F302R8TX
GenF3.menu.pnum.GENERIC_F302R8TX.build.product_line=STM32F302x8
GenF3.menu.pnum.GENERIC_F302R8TX.build.variant=STM32F3xx/F302R(6-8)T

# Generic F303C6Tx
GenF3.menu.pnum.GENERIC_F303C6TX=Generic F303C6Tx
GenF3.menu.pnum.GENERIC_F303C6TX.upload.maximum_size=32768
GenF3.menu.pnum.GENERIC_F303C6TX.upload.maximum_data_size=12288
GenF3.menu.pnum.GENERIC_F303C6TX.build.board=GENERIC_F303C6TX
GenF3.menu.pnum.GENERIC_F303C6TX.build.product_line=STM32F303x8
GenF3.menu.pnum.GENERIC_F303C6TX.build.variant=STM32F3xx/F303C(6-8)T_F334C(4-6-8)T

# Generic F303C8Tx
GenF3.menu.pnum.GENERIC_F303C8TX=Generic F303C8Tx
GenF3.menu.pnum.GENERIC_F303C8TX.upload.maximum_size=65536
GenF3.menu.pnum.GENERIC_F303C8TX.upload.maximum_data_size=12288
GenF3.menu.pnum.GENERIC_F303C8TX.build.board=GENERIC_F303C8TX
GenF3.menu.pnum.GENERIC_F303C8TX.build.product_line=STM32F303x8
GenF3.menu.pnum.GENERIC_F303C8TX.build.variant=STM32F3xx/F303C(6-8)T_F334C(4-6-8)T

# Generic F303CBTx
GenF3.menu.pnum.GENERIC_F303CBTX=Generic F303CBTx
GenF3.menu.pnum.GENERIC_F303CBTX.upload.maximum_size=131072
GenF3.menu.pnum.GENERIC_F303CBTX.upload.maximum_data_size=32768
GenF3.menu.pnum.GENERIC_F303CBTX.build.board=GENERIC_F303CBTX
GenF3.menu.pnum.GENERIC_F303CBTX.build.product_line=STM32F303xC
GenF3.menu.pnum.GENERIC_F303CBTX.build.variant=STM32F3xx/F303C(B-C)T

# Generic F303CCTx
GenF3.menu.pnum.GENERIC_F303CCTX=Generic F303CCTx
GenF3.menu.pnum.GENERIC_F303CCTX.upload.maximum_size=262144
GenF3.menu.pnum.GENERIC_F303CCTX.upload.maximum_data_size=40960
GenF3.menu.pnum.GENERIC_F303CCTX.build.board=GENERIC_F303CCTX
GenF3.menu.pnum.GENERIC_F303CCTX.build.product_line=STM32F303xC
GenF3.menu.pnum.GENERIC_F303CCTX.build.variant=STM32F3xx/F303C(B-C)T

# Generic F303K6Tx
GenF3.menu.pnum.GENERIC_F303K6TX=Generic F303K6Tx
GenF3.menu.pnum.GENERIC_F303K6TX.upload.maximum_size=32768
GenF3.menu.pnum.GENERIC_F303K6TX.upload.maximum_data_size=12288
GenF3.menu.pnum.GENERIC_F303K6TX.build.board=GENERIC_F303K6TX
GenF3.menu.pnum.GENERIC_F303K6TX.build.product_line=STM32F303x8
GenF3.menu.pnum.GENERIC_F303K6TX.build.variant=STM32F3xx/F303K(6-8)T_F334K(4-6-8)T

