chcbaram/CODING_SOGUL_STM32/boards.txt
# Generic F303K8Tx
GenF3.menu.pnum.GENERIC_F303K8TX=Generic F303K8Tx
GenF3.menu.pnum.GENERIC_F303K8TX.upload.maximum_size=65536
GenF3.menu.pnum.GENERIC_F303K8TX.upload.maximum_data_size=12288
GenF3.menu.pnum.GENERIC_F303K8TX.build.board=GENERIC_F303K8TX
GenF3.menu.pnum.GENERIC_F303K8TX.build.product_line=STM32F303x8
GenF3.menu.pnum.GENERIC_F303K8TX.build.variant=STM32F3xx/F303K(6-8)T_F334K(4-6-8)T

# Generic F303R6Tx
GenF3.menu.pnum.GENERIC_F303R6TX=Generic F303R6Tx
GenF3.menu.pnum.GENERIC_F303R6TX.upload.maximum_size=32768
GenF3.menu.pnum.GENERIC_F303R6TX.upload.maximum_data_size=12288
GenF3.menu.pnum.GENERIC_F303R6TX.build.board=GENERIC_F303R6TX
GenF3.menu.pnum.GENERIC_F303R6TX.build.product_line=STM32F303x8
GenF3.menu.pnum.GENERIC_F303R6TX.build.variant=STM32F3xx/F303R(6-8)T_F334R(6-8)T

# Generic F303R8Tx
GenF3.menu.pnum.GENERIC_F303R8TX=Generic F303R8Tx
GenF3.menu.pnum.GENERIC_F303R8TX.upload.maximum_size=65536
GenF3.menu.pnum.GENERIC_F303R8TX.upload.maximum_data_size=12288
GenF3.menu.pnum.GENERIC_F303R8TX.build.board=GENERIC_F303R8TX
GenF3.menu.pnum.GENERIC_F303R8TX.build.product_line=STM32F303x8
GenF3.menu.pnum.GENERIC_F303R8TX.build.variant=STM32F3xx/F303R(6-8)T_F334R(6-8)T

# Generic F303RBTx
GenF3.menu.pnum.GENERIC_F303RBTX=Generic F303RBTx
GenF3.menu.pnum.GENERIC_F303RBTX.upload.maximum_size=131072
GenF3.menu.pnum.GENERIC_F303RBTX.upload.maximum_data_size=32768
GenF3.menu.pnum.GENERIC_F303RBTX.build.board=GENERIC_F303RBTX
GenF3.menu.pnum.GENERIC_F303RBTX.build.product_line=STM32F303xC
GenF3.menu.pnum.GENERIC_F303RBTX.build.variant=STM32F3xx/F303R(B-C)T

# Generic F303RCTx
GenF3.menu.pnum.GENERIC_F303RCTX=Generic F303RCTx
GenF3.menu.pnum.GENERIC_F303RCTX.upload.maximum_size=262144
GenF3.menu.pnum.GENERIC_F303RCTX.upload.maximum_data_size=40960
GenF3.menu.pnum.GENERIC_F303RCTX.build.board=GENERIC_F303RCTX
GenF3.menu.pnum.GENERIC_F303RCTX.build.product_line=STM32F303xC
GenF3.menu.pnum.GENERIC_F303RCTX.build.variant=STM32F3xx/F303R(B-C)T

# Generic F303RDTx
GenF3.menu.pnum.GENERIC_F303RDTX=Generic F303RDTx
GenF3.menu.pnum.GENERIC_F303RDTX.upload.maximum_size=393216
GenF3.menu.pnum.GENERIC_F303RDTX.upload.maximum_data_size=65536
GenF3.menu.pnum.GENERIC_F303RDTX.build.board=GENERIC_F303RDTX
GenF3.menu.pnum.GENERIC_F303RDTX.build.product_line=STM32F303xE
GenF3.menu.pnum.GENERIC_F303RDTX.build.variant=STM32F3xx/F303R(D-E)T

# Generic F303RETx
GenF3.menu.pnum.GENERIC_F303RETX=Generic F303RETx
GenF3.menu.pnum.GENERIC_F303RETX.upload.maximum_size=524288
GenF3.menu.pnum.GENERIC_F303RETX.upload.maximum_data_size=65536
GenF3.menu.pnum.GENERIC_F303RETX.build.board=GENERIC_F303RETX
GenF3.menu.pnum.GENERIC_F303RETX.build.product_line=STM32F303xE
GenF3.menu.pnum.GENERIC_F303RETX.build.variant=STM32F3xx/F303R(D-E)T

# Generic F303VBTx
GenF3.menu.pnum.GENERIC_F303VBTX=Generic F303VBTx
GenF3.menu.pnum.GENERIC_F303VBTX.upload.maximum_size=131072
GenF3.menu.pnum.GENERIC_F303VBTX.upload.maximum_data_size=32768
GenF3.menu.pnum.GENERIC_F303VBTX.build.board=GENERIC_F303VBTX
GenF3.menu.pnum.GENERIC_F303VBTX.build.product_line=STM32F303xC
GenF3.menu.pnum.GENERIC_F303VBTX.build.variant=STM32F3xx/F303V(B-C)T

# Generic F303VCTx
GenF3.menu.pnum.GENERIC_F303VCTX=Generic F303VCTx
GenF3.menu.pnum.GENERIC_F303VCTX.upload.maximum_size=262144
GenF3.menu.pnum.GENERIC_F303VCTX.upload.maximum_data_size=40960
GenF3.menu.pnum.GENERIC_F303VCTX.build.board=GENERIC_F303VCTX
GenF3.menu.pnum.GENERIC_F303VCTX.build.product_line=STM32F303xC
GenF3.menu.pnum.GENERIC_F303VCTX.build.variant=STM32F3xx/F303V(B-C)T

# Generic F318C8Tx
GenF3.menu.pnum.GENERIC_F318C8TX=Generic F318C8Tx
GenF3.menu.pnum.GENERIC_F318C8TX.upload.maximum_size=65536
GenF3.menu.pnum.GENERIC_F318C8TX.upload.maximum_data_size=16384
GenF3.menu.pnum.GENERIC_F318C8TX.build.board=GENERIC_F318C8TX
GenF3.menu.pnum.GENERIC_F318C8TX.build.product_line=STM32F318xx
GenF3.menu.pnum.GENERIC_F318C8TX.build.variant=STM32F3xx/F318C8(T-Y)

# Generic F318C8Yx
GenF3.menu.pnum.GENERIC_F318C8YX=Generic F318C8Yx
GenF3.menu.pnum.GENERIC_F318C8YX.upload.maximum_size=65536
GenF3.menu.pnum.GENERIC_F318C8YX.upload.maximum_data_size=16384
GenF3.menu.pnum.GENERIC_F318C8YX.build.board=GENERIC_F318C8YX
GenF3.menu.pnum.GENERIC_F318C8YX.build.product_line=STM32F318xx
GenF3.menu.pnum.GENERIC_F318C8YX.build.variant=STM32F3xx/F318C8(T-Y)

# Generic F318K8Ux
GenF3.menu.pnum.GENERIC_F318K8UX=Generic F318K8Ux
GenF3.menu.pnum.GENERIC_F318K8UX.upload.maximum_size=65536
GenF3.menu.pnum.GENERIC_F318K8UX.upload.maximum_data_size=16384
GenF3.menu.pnum.GENERIC_F318K8UX.build.board=GENERIC_F318K8UX
GenF3.menu.pnum.GENERIC_F318K8UX.build.product_line=STM32F318xx
GenF3.menu.pnum.GENERIC_F318K8UX.build.variant=STM32F3xx/F318K8U

# Generic F328C8Tx
GenF3.menu.pnum.GENERIC_F328C8TX=Generic F328C8Tx
GenF3.menu.pnum.GENERIC_F328C8TX.upload.maximum_size=65536
GenF3.menu.pnum.GENERIC_F328C8TX.upload.maximum_data_size=12288
GenF3.menu.pnum.GENERIC_F328C8TX.build.board=GENERIC_F328C8TX
GenF3.menu.pnum.GENERIC_F328C8TX.build.product_line=STM32F328xx
GenF3.menu.pnum.GENERIC_F328C8TX.build.variant=STM32F3xx/F328C8T

# Generic F334C4Tx
GenF3.menu.pnum.GENERIC_F334C4TX=Generic F334C4Tx
GenF3.menu.pnum.GENERIC_F334C4TX.upload.maximum_size=16384
GenF3.menu.pnum.GENERIC_F334C4TX.upload.maximum_data_size=12288
GenF3.menu.pnum.GENERIC_F334C4TX.build.board=GENERIC_F334C4TX
GenF3.menu.pnum.GENERIC_F334C4TX.build.product_line=STM32F334x8
GenF3.menu.pnum.GENERIC_F334C4TX.build.variant=STM32F3xx/F303C(6-8)T_F334C(4-6-8)T

# Generic F334C6Tx
GenF3.menu.pnum.GENERIC_F334C6TX=Generic F334C6Tx
GenF3.menu.pnum.GENERIC_F334C6TX.upload.maximum_size=32768
GenF3.menu.pnum.GENERIC_F334C6TX.upload.maximum_data_size=12288
GenF3.menu.pnum.GENERIC_F334C6TX.build.board=GENERIC_F334C6TX
GenF3.menu.pnum.GENERIC_F334C6TX.build.product_line=STM32F334x8
GenF3.menu.pnum.GENERIC_F334C6TX.build.variant=STM32F3xx/F303C(6-8)T_F334C(4-6-8)T

# Generic F334C8Tx
GenF3.menu.pnum.GENERIC_F334C8TX=Generic F334C8Tx
GenF3.menu.pnum.GENERIC_F334C8TX.upload.maximum_size=65536
GenF3.menu.pnum.GENERIC_F334C8TX.upload.maximum_data_size=12288
GenF3.menu.pnum.GENERIC_F334C8TX.build.board=GENERIC_F334C8TX
GenF3.menu.pnum.GENERIC_F334C8TX.build.product_line=STM32F334x8
GenF3.menu.pnum.GENERIC_F334C8TX.build.variant=STM32F3xx/F303C(6-8)T_F334C(4-6-8)T

# Generic F334K4Tx
GenF3.menu.pnum.GENERIC_F334K4TX=Generic F334K4Tx
GenF3.menu.pnum.GENERIC_F334K4TX.upload.maximum_size=16384
GenF3.menu.pnum.GENERIC_F334K4TX.upload.maximum_data_size=12288
GenF3.menu.pnum.GENERIC_F334K4TX.build.board=GENERIC_F334K4TX
GenF3.menu.pnum.GENERIC_F334K4TX.build.product_line=STM32F334x8
GenF3.menu.pnum.GENERIC_F334K4TX.build.variant=STM32F3xx/F303K(6-8)T_F334K(4-6-8)T

