chcbaram/CODING_SOGUL_STM32/boards.txt
GenF7.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenF7.menu.upload_method.serialMethod.upload.protocol=1
GenF7.menu.upload_method.serialMethod.upload.options={serial.port.file}
GenF7.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenF7.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenF7.menu.upload_method.dfuMethod.upload.protocol=2
GenF7.menu.upload_method.dfuMethod.upload.options=
GenF7.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

###############################
# Generic G0
GenG0.name=Generic STM32G0 series

GenG0.build.core=arduino
GenG0.build.board=GenG0
GenG0.build.mcu=cortex-m0plus
GenG0.build.series=STM32G0xx
GenG0.build.cmsis_lib_gcc=arm_cortexM0l_math
GenG0.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} -D__CORTEX_SC=0
GenG0.build.flash_offset=0x0
GenG0.upload.maximum_size=0
GenG0.upload.maximum_data_size=0

# AGAFIA SG0
GenG0.menu.pnum.AGAFIA_SG0=AGAFIA SG0
GenG0.menu.pnum.AGAFIA_SG0.upload.maximum_size=131072
GenG0.menu.pnum.AGAFIA_SG0.upload.maximum_data_size=36864
GenG0.menu.pnum.AGAFIA_SG0.build.board=AGAFIA_SG0
GenG0.menu.pnum.AGAFIA_SG0.build.product_line=STM32G071xx
GenG0.menu.pnum.AGAFIA_SG0.build.variant=STM32G0xx/G071C(6-8-B)(T-U)_G081CB(T-U)
GenG0.menu.pnum.AGAFIA_SG0.build.variant_h=variant_{build.board}.h

# Aurora One G030K8
GenG0.menu.pnum.AURORA_ONE=Aurora One
GenG0.menu.pnum.AURORA_ONE.upload.maximum_size=65536
GenG0.menu.pnum.AURORA_ONE.upload.maximum_data_size=8192
GenG0.menu.pnum.AURORA_ONE.build.board=AURORA_ONE
GenG0.menu.pnum.AURORA_ONE.build.product_line=STM32G030xx
GenG0.menu.pnum.AURORA_ONE.build.variant=STM32G0xx/G030K(6-8)T
GenG0.menu.pnum.AURORA_ONE.build.variant_h=variant_{build.board}.h

# Generic G030C6Tx
GenG0.menu.pnum.GENERIC_G030C6TX=Generic G030C6Tx
GenG0.menu.pnum.GENERIC_G030C6TX.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G030C6TX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G030C6TX.build.board=GENERIC_G030C6TX
GenG0.menu.pnum.GENERIC_G030C6TX.build.product_line=STM32G030xx
GenG0.menu.pnum.GENERIC_G030C6TX.build.variant=STM32G0xx/G030C(6-8)T

# Generic G030C8Tx
GenG0.menu.pnum.GENERIC_G030C8TX=Generic G030C8Tx
GenG0.menu.pnum.GENERIC_G030C8TX.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G030C8TX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G030C8TX.build.board=GENERIC_G030C8TX
GenG0.menu.pnum.GENERIC_G030C8TX.build.product_line=STM32G030xx
GenG0.menu.pnum.GENERIC_G030C8TX.build.variant=STM32G0xx/G030C(6-8)T

# Generic G030F6Px
GenG0.menu.pnum.GENERIC_G030F6PX=Generic G030F6Px
GenG0.menu.pnum.GENERIC_G030F6PX.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G030F6PX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G030F6PX.build.board=GENERIC_G030F6PX
GenG0.menu.pnum.GENERIC_G030F6PX.build.product_line=STM32G030xx
GenG0.menu.pnum.GENERIC_G030F6PX.build.variant=STM32G0xx/G030F6P

# Generic G030J6Mx
GenG0.menu.pnum.GENERIC_G030J6MX=Generic G030J6Mx
GenG0.menu.pnum.GENERIC_G030J6MX.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G030J6MX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G030J6MX.build.board=GENERIC_G030J6MX
GenG0.menu.pnum.GENERIC_G030J6MX.build.product_line=STM32G030xx
GenG0.menu.pnum.GENERIC_G030J6MX.build.variant=STM32G0xx/G030J6M

# Generic G030K6Tx
GenG0.menu.pnum.GENERIC_G030K6TX=Generic G030K6Tx
GenG0.menu.pnum.GENERIC_G030K6TX.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G030K6TX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G030K6TX.build.board=GENERIC_G030K6TX
GenG0.menu.pnum.GENERIC_G030K6TX.build.product_line=STM32G030xx
GenG0.menu.pnum.GENERIC_G030K6TX.build.variant=STM32G0xx/G030K(6-8)T

# Generic G030K8Tx
GenG0.menu.pnum.GENERIC_G030K8TX=Generic G030K8Tx
GenG0.menu.pnum.GENERIC_G030K8TX.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G030K8TX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G030K8TX.build.board=GENERIC_G030K8TX
GenG0.menu.pnum.GENERIC_G030K8TX.build.product_line=STM32G030xx
GenG0.menu.pnum.GENERIC_G030K8TX.build.variant=STM32G0xx/G030K(6-8)T

# Generic G031C4Tx
GenG0.menu.pnum.GENERIC_G031C4TX=Generic G031C4Tx
GenG0.menu.pnum.GENERIC_G031C4TX.upload.maximum_size=16384
GenG0.menu.pnum.GENERIC_G031C4TX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G031C4TX.build.board=GENERIC_G031C4TX
GenG0.menu.pnum.GENERIC_G031C4TX.build.product_line=STM32G031xx
GenG0.menu.pnum.GENERIC_G031C4TX.build.variant=STM32G0xx/G031C(4-6-8)(T-U)_G041C(6-8)(T-U)

# Generic G031C6Tx
GenG0.menu.pnum.GENERIC_G031C6TX=Generic G031C6Tx
GenG0.menu.pnum.GENERIC_G031C6TX.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G031C6TX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G031C6TX.build.board=GENERIC_G031C6TX
GenG0.menu.pnum.GENERIC_G031C6TX.build.product_line=STM32G031xx
GenG0.menu.pnum.GENERIC_G031C6TX.build.variant=STM32G0xx/G031C(4-6-8)(T-U)_G041C(6-8)(T-U)

# Generic G031C8Tx
GenG0.menu.pnum.GENERIC_G031C8TX=Generic G031C8Tx
GenG0.menu.pnum.GENERIC_G031C8TX.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G031C8TX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G031C8TX.build.board=GENERIC_G031C8TX
GenG0.menu.pnum.GENERIC_G031C8TX.build.product_line=STM32G031xx
GenG0.menu.pnum.GENERIC_G031C8TX.build.variant=STM32G0xx/G031C(4-6-8)(T-U)_G041C(6-8)(T-U)

# Generic G031C4Ux
GenG0.menu.pnum.GENERIC_G031C4UX=Generic G031C4Ux
GenG0.menu.pnum.GENERIC_G031C4UX.upload.maximum_size=16384
GenG0.menu.pnum.GENERIC_G031C4UX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G031C4UX.build.board=GENERIC_G031C4UX
GenG0.menu.pnum.GENERIC_G031C4UX.build.product_line=STM32G031xx
GenG0.menu.pnum.GENERIC_G031C4UX.build.variant=STM32G0xx/G031C(4-6-8)(T-U)_G041C(6-8)(T-U)

# Generic G031C6Ux
GenG0.menu.pnum.GENERIC_G031C6UX=Generic G031C6Ux
GenG0.menu.pnum.GENERIC_G031C6UX.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G031C6UX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G031C6UX.build.board=GENERIC_G031C6UX
GenG0.menu.pnum.GENERIC_G031C6UX.build.product_line=STM32G031xx
GenG0.menu.pnum.GENERIC_G031C6UX.build.variant=STM32G0xx/G031C(4-6-8)(T-U)_G041C(6-8)(T-U)

# Generic G031C8Ux
GenG0.menu.pnum.GENERIC_G031C8UX=Generic G031C8Ux
GenG0.menu.pnum.GENERIC_G031C8UX.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G031C8UX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G031C8UX.build.board=GENERIC_G031C8UX
GenG0.menu.pnum.GENERIC_G031C8UX.build.product_line=STM32G031xx
GenG0.menu.pnum.GENERIC_G031C8UX.build.variant=STM32G0xx/G031C(4-6-8)(T-U)_G041C(6-8)(T-U)

