chcbaram/CODING_SOGUL_STM32/boards.txt
# Generic G031G4Ux
GenG0.menu.pnum.GENERIC_G031G4UX=Generic G031G4Ux
GenG0.menu.pnum.GENERIC_G031G4UX.upload.maximum_size=16384
GenG0.menu.pnum.GENERIC_G031G4UX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G031G4UX.build.board=GENERIC_G031G4UX
GenG0.menu.pnum.GENERIC_G031G4UX.build.product_line=STM32G031xx
GenG0.menu.pnum.GENERIC_G031G4UX.build.variant=STM32G0xx/G031G(4-6-8)U_G041G(6-8)U

# Generic G031G6Ux
GenG0.menu.pnum.GENERIC_G031G6UX=Generic G031G6Ux
GenG0.menu.pnum.GENERIC_G031G6UX.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G031G6UX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G031G6UX.build.board=GENERIC_G031G6UX
GenG0.menu.pnum.GENERIC_G031G6UX.build.product_line=STM32G031xx
GenG0.menu.pnum.GENERIC_G031G6UX.build.variant=STM32G0xx/G031G(4-6-8)U_G041G(6-8)U

# Generic G031G8Ux
GenG0.menu.pnum.GENERIC_G031G8UX=Generic G031G8Ux
GenG0.menu.pnum.GENERIC_G031G8UX.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G031G8UX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G031G8UX.build.board=GENERIC_G031G8UX
GenG0.menu.pnum.GENERIC_G031G8UX.build.product_line=STM32G031xx
GenG0.menu.pnum.GENERIC_G031G8UX.build.variant=STM32G0xx/G031G(4-6-8)U_G041G(6-8)U

# Generic G041G6Ux
GenG0.menu.pnum.GENERIC_G041G6UX=Generic G041G6Ux
GenG0.menu.pnum.GENERIC_G041G6UX.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G041G6UX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G041G6UX.build.board=GENERIC_G041G6UX
GenG0.menu.pnum.GENERIC_G041G6UX.build.product_line=STM32G041xx
GenG0.menu.pnum.GENERIC_G041G6UX.build.variant=STM32G0xx/G031G(4-6-8)U_G041G(6-8)U

# Generic G041G8Ux
GenG0.menu.pnum.GENERIC_G041G8UX=Generic G041G8Ux
GenG0.menu.pnum.GENERIC_G041G8UX.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G041G8UX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G041G8UX.build.board=GENERIC_G041G8UX
GenG0.menu.pnum.GENERIC_G041G8UX.build.product_line=STM32G041xx
GenG0.menu.pnum.GENERIC_G041G8UX.build.variant=STM32G0xx/G031G(4-6-8)U_G041G(6-8)U

# Generic G041C6Tx
GenG0.menu.pnum.GENERIC_G041C6TX=Generic G041C6Tx
GenG0.menu.pnum.GENERIC_G041C6TX.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G041C6TX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G041C6TX.build.board=GENERIC_G041C6TX
GenG0.menu.pnum.GENERIC_G041C6TX.build.product_line=STM32G041xx
GenG0.menu.pnum.GENERIC_G041C6TX.build.variant=STM32G0xx/G031C(4-6-8)(T-U)_G041C(6-8)(T-U)

# Generic G041C8Tx
GenG0.menu.pnum.GENERIC_G041C8TX=Generic G041C8Tx
GenG0.menu.pnum.GENERIC_G041C8TX.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G041C8TX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G041C8TX.build.board=GENERIC_G041C8TX
GenG0.menu.pnum.GENERIC_G041C8TX.build.product_line=STM32G041xx
GenG0.menu.pnum.GENERIC_G041C8TX.build.variant=STM32G0xx/G031C(4-6-8)(T-U)_G041C(6-8)(T-U)

# Generic G041C6Ux
GenG0.menu.pnum.GENERIC_G041C6UX=Generic G041C6Ux
GenG0.menu.pnum.GENERIC_G041C6UX.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G041C6UX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G041C6UX.build.board=GENERIC_G041C6UX
GenG0.menu.pnum.GENERIC_G041C6UX.build.product_line=STM32G041xx
GenG0.menu.pnum.GENERIC_G041C6UX.build.variant=STM32G0xx/G031C(4-6-8)(T-U)_G041C(6-8)(T-U)

# Generic G041C8Ux
GenG0.menu.pnum.GENERIC_G041C8UX=Generic G041C8Ux
GenG0.menu.pnum.GENERIC_G041C8UX.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G041C8UX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G041C8UX.build.board=GENERIC_G041C8UX
GenG0.menu.pnum.GENERIC_G041C8UX.build.product_line=STM32G041xx
GenG0.menu.pnum.GENERIC_G041C8UX.build.variant=STM32G0xx/G031C(4-6-8)(T-U)_G041C(6-8)(T-U)

# Generic G031J4Mx
GenG0.menu.pnum.GENERIC_G031J4MX=Generic G031J4Mx
GenG0.menu.pnum.GENERIC_G031J4MX.upload.maximum_size=16384
GenG0.menu.pnum.GENERIC_G031J4MX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G031J4MX.build.board=GENERIC_G031J4MX
GenG0.menu.pnum.GENERIC_G031J4MX.build.product_line=STM32G031xx
GenG0.menu.pnum.GENERIC_G031J4MX.build.variant=STM32G0xx/G031J(4-6)M_G041J6M

# Generic G031J6Mx
GenG0.menu.pnum.GENERIC_G031J6MX=Generic G031J6Mx
GenG0.menu.pnum.GENERIC_G031J6MX.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G031J6MX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G031J6MX.build.board=GENERIC_G031J6MX
GenG0.menu.pnum.GENERIC_G031J6MX.build.product_line=STM32G031xx
GenG0.menu.pnum.GENERIC_G031J6MX.build.variant=STM32G0xx/G031J(4-6)M_G041J6M

# Generic G031F4Px
GenG0.menu.pnum.GENERIC_G031F4PX=Generic G031F4Px
GenG0.menu.pnum.GENERIC_G031F4PX.upload.maximum_size=16384
GenG0.menu.pnum.GENERIC_G031F4PX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G031F4PX.build.board=GENERIC_G031F4PX
GenG0.menu.pnum.GENERIC_G031F4PX.build.product_line=STM32G031xx
GenG0.menu.pnum.GENERIC_G031F4PX.build.variant=STM32G0xx/G031F(4-6-8)P_G031Y8Y_G041F(6-8)P_G041Y8Y

# Generic G031F6Px
GenG0.menu.pnum.GENERIC_G031F6PX=Generic G031F6Px
GenG0.menu.pnum.GENERIC_G031F6PX.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G031F6PX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G031F6PX.build.board=GENERIC_G031F6PX
GenG0.menu.pnum.GENERIC_G031F6PX.build.product_line=STM32G031xx
GenG0.menu.pnum.GENERIC_G031F6PX.build.variant=STM32G0xx/G031F(4-6-8)P_G031Y8Y_G041F(6-8)P_G041Y8Y

# Generic G031F8Px
GenG0.menu.pnum.GENERIC_G031F8PX=Generic G031F8Px
GenG0.menu.pnum.GENERIC_G031F8PX.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G031F8PX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G031F8PX.build.board=GENERIC_G031F8PX
GenG0.menu.pnum.GENERIC_G031F8PX.build.product_line=STM32G031xx
GenG0.menu.pnum.GENERIC_G031F8PX.build.variant=STM32G0xx/G031F(4-6-8)P_G031Y8Y_G041F(6-8)P_G041Y8Y

# Generic G031Y8Yx
GenG0.menu.pnum.GENERIC_G031Y8YX=Generic G031Y8Yx
GenG0.menu.pnum.GENERIC_G031Y8YX.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G031Y8YX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G031Y8YX.build.board=GENERIC_G031Y8YX
GenG0.menu.pnum.GENERIC_G031Y8YX.build.product_line=STM32G031xx
GenG0.menu.pnum.GENERIC_G031Y8YX.build.variant=STM32G0xx/G031F(4-6-8)P_G031Y8Y_G041F(6-8)P_G041Y8Y

# Generic G031K4Tx
GenG0.menu.pnum.GENERIC_G031K4TX=Generic G031K4Tx
GenG0.menu.pnum.GENERIC_G031K4TX.upload.maximum_size=16384
GenG0.menu.pnum.GENERIC_G031K4TX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G031K4TX.build.board=GENERIC_G031K4TX
GenG0.menu.pnum.GENERIC_G031K4TX.build.product_line=STM32G031xx
GenG0.menu.pnum.GENERIC_G031K4TX.build.variant=STM32G0xx/G031K(4-6-8)(T-U)_G041K(6-8)(T-U)

# Generic G031K6Tx
GenG0.menu.pnum.GENERIC_G031K6TX=Generic G031K6Tx
GenG0.menu.pnum.GENERIC_G031K6TX.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G031K6TX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G031K6TX.build.board=GENERIC_G031K6TX
GenG0.menu.pnum.GENERIC_G031K6TX.build.product_line=STM32G031xx
GenG0.menu.pnum.GENERIC_G031K6TX.build.variant=STM32G0xx/G031K(4-6-8)(T-U)_G041K(6-8)(T-U)

# Generic G031K8Tx
GenG0.menu.pnum.GENERIC_G031K8TX=Generic G031K8Tx
GenG0.menu.pnum.GENERIC_G031K8TX.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G031K8TX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G031K8TX.build.board=GENERIC_G031K8TX
GenG0.menu.pnum.GENERIC_G031K8TX.build.product_line=STM32G031xx
GenG0.menu.pnum.GENERIC_G031K8TX.build.variant=STM32G0xx/G031K(4-6-8)(T-U)_G041K(6-8)(T-U)

