chcbaram/CODING_SOGUL_STM32/boards.txt
# Generic G070RBTx
GenG0.menu.pnum.GENERIC_G070RBTX=Generic G070RBTx
GenG0.menu.pnum.GENERIC_G070RBTX.upload.maximum_size=131072
GenG0.menu.pnum.GENERIC_G070RBTX.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G070RBTX.build.board=GENERIC_G070RBTX
GenG0.menu.pnum.GENERIC_G070RBTX.build.product_line=STM32G070xx
GenG0.menu.pnum.GENERIC_G070RBTX.build.variant=STM32G0xx/G070RBT

# Generic G071C6Tx
GenG0.menu.pnum.GENERIC_G071C6TX=Generic G071C6Tx
GenG0.menu.pnum.GENERIC_G071C6TX.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G071C6TX.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G071C6TX.build.board=GENERIC_G071C6TX
GenG0.menu.pnum.GENERIC_G071C6TX.build.product_line=STM32G071xx
GenG0.menu.pnum.GENERIC_G071C6TX.build.variant=STM32G0xx/G071C(6-8-B)(T-U)_G081CB(T-U)

# Generic G071C8Tx
GenG0.menu.pnum.GENERIC_G071C8TX=Generic G071C8Tx
GenG0.menu.pnum.GENERIC_G071C8TX.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G071C8TX.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G071C8TX.build.board=GENERIC_G071C8TX
GenG0.menu.pnum.GENERIC_G071C8TX.build.product_line=STM32G071xx
GenG0.menu.pnum.GENERIC_G071C8TX.build.variant=STM32G0xx/G071C(6-8-B)(T-U)_G081CB(T-U)

# Generic G071CBTx
GenG0.menu.pnum.GENERIC_G071CBTX=Generic G071CBTx
GenG0.menu.pnum.GENERIC_G071CBTX.upload.maximum_size=131072
GenG0.menu.pnum.GENERIC_G071CBTX.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G071CBTX.build.board=GENERIC_G071CBTX
GenG0.menu.pnum.GENERIC_G071CBTX.build.product_line=STM32G071xx
GenG0.menu.pnum.GENERIC_G071CBTX.build.variant=STM32G0xx/G071C(6-8-B)(T-U)_G081CB(T-U)

# Generic G071C6Ux
GenG0.menu.pnum.GENERIC_G071C6UX=Generic G071C6Ux
GenG0.menu.pnum.GENERIC_G071C6UX.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G071C6UX.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G071C6UX.build.board=GENERIC_G071C6UX
GenG0.menu.pnum.GENERIC_G071C6UX.build.product_line=STM32G071xx
GenG0.menu.pnum.GENERIC_G071C6UX.build.variant=STM32G0xx/G071C(6-8-B)(T-U)_G081CB(T-U)

# Generic G071C8Ux
GenG0.menu.pnum.GENERIC_G071C8UX=Generic G071C8Ux
GenG0.menu.pnum.GENERIC_G071C8UX.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G071C8UX.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G071C8UX.build.board=GENERIC_G071C8UX
GenG0.menu.pnum.GENERIC_G071C8UX.build.product_line=STM32G071xx
GenG0.menu.pnum.GENERIC_G071C8UX.build.variant=STM32G0xx/G071C(6-8-B)(T-U)_G081CB(T-U)

# Generic G071CBUx
GenG0.menu.pnum.GENERIC_G071CBUX=Generic G071CBUx
GenG0.menu.pnum.GENERIC_G071CBUX.upload.maximum_size=131072
GenG0.menu.pnum.GENERIC_G071CBUX.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G071CBUX.build.board=GENERIC_G071CBUX
GenG0.menu.pnum.GENERIC_G071CBUX.build.product_line=STM32G071xx
GenG0.menu.pnum.GENERIC_G071CBUX.build.variant=STM32G0xx/G071C(6-8-B)(T-U)_G081CB(T-U)

# Generic G071G8UxN
GenG0.menu.pnum.GENERIC_G071G8UXN=Generic G071G8UxN
GenG0.menu.pnum.GENERIC_G071G8UXN.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G071G8UXN.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G071G8UXN.build.board=GENERIC_G071G8UXN
GenG0.menu.pnum.GENERIC_G071G8UXN.build.product_line=STM32G071xx
GenG0.menu.pnum.GENERIC_G071G8UXN.build.variant=STM32G0xx/G071G(8-B)UxN_G081GBUxN

# Generic G071GBUxN
GenG0.menu.pnum.GENERIC_G071GBUXN=Generic G071GBUxN
GenG0.menu.pnum.GENERIC_G071GBUXN.upload.maximum_size=131072
GenG0.menu.pnum.GENERIC_G071GBUXN.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G071GBUXN.build.board=GENERIC_G071GBUXN
GenG0.menu.pnum.GENERIC_G071GBUXN.build.product_line=STM32G071xx
GenG0.menu.pnum.GENERIC_G071GBUXN.build.variant=STM32G0xx/G071G(8-B)UxN_G081GBUxN

# Generic G071K6Tx
GenG0.menu.pnum.GENERIC_G071K6TX=Generic G071K6Tx
GenG0.menu.pnum.GENERIC_G071K6TX.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G071K6TX.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G071K6TX.build.board=GENERIC_G071K6TX
GenG0.menu.pnum.GENERIC_G071K6TX.build.product_line=STM32G071xx
GenG0.menu.pnum.GENERIC_G071K6TX.build.variant=STM32G0xx/G071K(6-8-B)(T-U)_G081KB(T-U)

# Generic G071K8Tx
GenG0.menu.pnum.GENERIC_G071K8TX=Generic G071K8Tx
GenG0.menu.pnum.GENERIC_G071K8TX.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G071K8TX.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G071K8TX.build.board=GENERIC_G071K8TX
GenG0.menu.pnum.GENERIC_G071K8TX.build.product_line=STM32G071xx
GenG0.menu.pnum.GENERIC_G071K8TX.build.variant=STM32G0xx/G071K(6-8-B)(T-U)_G081KB(T-U)

# Generic G071KBTx
GenG0.menu.pnum.GENERIC_G071KBTX=Generic G071KBTx
GenG0.menu.pnum.GENERIC_G071KBTX.upload.maximum_size=131072
GenG0.menu.pnum.GENERIC_G071KBTX.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G071KBTX.build.board=GENERIC_G071KBTX
GenG0.menu.pnum.GENERIC_G071KBTX.build.product_line=STM32G071xx
GenG0.menu.pnum.GENERIC_G071KBTX.build.variant=STM32G0xx/G071K(6-8-B)(T-U)_G081KB(T-U)

# Generic G071K6Ux
GenG0.menu.pnum.GENERIC_G071K6UX=Generic G071K6Ux
GenG0.menu.pnum.GENERIC_G071K6UX.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G071K6UX.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G071K6UX.build.board=GENERIC_G071K6UX
GenG0.menu.pnum.GENERIC_G071K6UX.build.product_line=STM32G071xx
GenG0.menu.pnum.GENERIC_G071K6UX.build.variant=STM32G0xx/G071K(6-8-B)(T-U)_G081KB(T-U)

# Generic G071K8Ux
GenG0.menu.pnum.GENERIC_G071K8UX=Generic G071K8Ux
GenG0.menu.pnum.GENERIC_G071K8UX.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G071K8UX.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G071K8UX.build.board=GENERIC_G071K8UX
GenG0.menu.pnum.GENERIC_G071K8UX.build.product_line=STM32G071xx
GenG0.menu.pnum.GENERIC_G071K8UX.build.variant=STM32G0xx/G071K(6-8-B)(T-U)_G081KB(T-U)

# Generic G071KBUx
GenG0.menu.pnum.GENERIC_G071KBUX=Generic G071KBUx
GenG0.menu.pnum.GENERIC_G071KBUX.upload.maximum_size=131072
GenG0.menu.pnum.GENERIC_G071KBUX.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G071KBUX.build.board=GENERIC_G071KBUX
GenG0.menu.pnum.GENERIC_G071KBUX.build.product_line=STM32G071xx
GenG0.menu.pnum.GENERIC_G071KBUX.build.variant=STM32G0xx/G071K(6-8-B)(T-U)_G081KB(T-U)

