chcbaram/CODING_SOGUL_STM32/boards.txt
# Generic G081KBTx
GenG0.menu.pnum.GENERIC_G081KBTX=Generic G081KBTx
GenG0.menu.pnum.GENERIC_G081KBTX.upload.maximum_size=131072
GenG0.menu.pnum.GENERIC_G081KBTX.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G081KBTX.build.board=GENERIC_G081KBTX
GenG0.menu.pnum.GENERIC_G081KBTX.build.product_line=STM32G081xx
GenG0.menu.pnum.GENERIC_G081KBTX.build.variant=STM32G0xx/G071K(6-8-B)(T-U)_G081KB(T-U)

# Generic G081KBUx
GenG0.menu.pnum.GENERIC_G081KBUX=Generic G081KBUx
GenG0.menu.pnum.GENERIC_G081KBUX.upload.maximum_size=131072
GenG0.menu.pnum.GENERIC_G081KBUX.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G081KBUX.build.board=GENERIC_G081KBUX
GenG0.menu.pnum.GENERIC_G081KBUX.build.product_line=STM32G081xx
GenG0.menu.pnum.GENERIC_G081KBUX.build.variant=STM32G0xx/G071K(6-8-B)(T-U)_G081KB(T-U)

# Generic G071R6Tx
GenG0.menu.pnum.GENERIC_G071R6TX=Generic G071R6Tx
GenG0.menu.pnum.GENERIC_G071R6TX.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G071R6TX.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G071R6TX.build.board=GENERIC_G071R6TX
GenG0.menu.pnum.GENERIC_G071R6TX.build.product_line=STM32G071xx
GenG0.menu.pnum.GENERIC_G071R6TX.build.variant=STM32G0xx/G071R(6-8)T_G071RB(I-T)_G081RB(I-T)

# Generic G071R8Tx
GenG0.menu.pnum.GENERIC_G071R8TX=Generic G071R8Tx
GenG0.menu.pnum.GENERIC_G071R8TX.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G071R8TX.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G071R8TX.build.board=GENERIC_G071R8TX
GenG0.menu.pnum.GENERIC_G071R8TX.build.product_line=STM32G071xx
GenG0.menu.pnum.GENERIC_G071R8TX.build.variant=STM32G0xx/G071R(6-8)T_G071RB(I-T)_G081RB(I-T)

# Generic G071RBTx
GenG0.menu.pnum.GENERIC_G071RBTX=Generic G071RBTx
GenG0.menu.pnum.GENERIC_G071RBTX.upload.maximum_size=131072
GenG0.menu.pnum.GENERIC_G071RBTX.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G071RBTX.build.board=GENERIC_G071RBTX
GenG0.menu.pnum.GENERIC_G071RBTX.build.product_line=STM32G071xx
GenG0.menu.pnum.GENERIC_G071RBTX.build.variant=STM32G0xx/G071R(6-8)T_G071RB(I-T)_G081RB(I-T)

# Generic G071RBIx
GenG0.menu.pnum.GENERIC_G071RBIX=Generic G071RBIx
GenG0.menu.pnum.GENERIC_G071RBIX.upload.maximum_size=131072
GenG0.menu.pnum.GENERIC_G071RBIX.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G071RBIX.build.board=GENERIC_G071RBIX
GenG0.menu.pnum.GENERIC_G071RBIX.build.product_line=STM32G071xx
GenG0.menu.pnum.GENERIC_G071RBIX.build.variant=STM32G0xx/G071R(6-8)T_G071RB(I-T)_G081RB(I-T)

# Generic G081CBTx
GenG0.menu.pnum.GENERIC_G081CBTX=Generic G081CBTx
GenG0.menu.pnum.GENERIC_G081CBTX.upload.maximum_size=131072
GenG0.menu.pnum.GENERIC_G081CBTX.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G081CBTX.build.board=GENERIC_G081CBTX
GenG0.menu.pnum.GENERIC_G081CBTX.build.product_line=STM32G081xx
GenG0.menu.pnum.GENERIC_G081CBTX.build.variant=STM32G0xx/G071C(6-8-B)(T-U)_G081CB(T-U)

# Generic G081CBUx
GenG0.menu.pnum.GENERIC_G081CBUX=Generic G081CBUx
GenG0.menu.pnum.GENERIC_G081CBUX.upload.maximum_size=131072
GenG0.menu.pnum.GENERIC_G081CBUX.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G081CBUX.build.board=GENERIC_G081CBUX
GenG0.menu.pnum.GENERIC_G081CBUX.build.product_line=STM32G081xx
GenG0.menu.pnum.GENERIC_G081CBUX.build.variant=STM32G0xx/G071C(6-8-B)(T-U)_G081CB(T-U)

# Generic G081GBUxN
GenG0.menu.pnum.GENERIC_G081GBUXN=Generic G081GBUxN
GenG0.menu.pnum.GENERIC_G081GBUXN.upload.maximum_size=131072
GenG0.menu.pnum.GENERIC_G081GBUXN.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G081GBUXN.build.board=GENERIC_G081GBUXN
GenG0.menu.pnum.GENERIC_G081GBUXN.build.product_line=STM32G081xx
GenG0.menu.pnum.GENERIC_G081GBUXN.build.variant=STM32G0xx/G071G(8-B)UxN_G081GBUxN

# Generic G081RBIx
GenG0.menu.pnum.GENERIC_G081RBIX=Generic G081RBIx
GenG0.menu.pnum.GENERIC_G081RBIX.upload.maximum_size=131072
GenG0.menu.pnum.GENERIC_G081RBIX.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G081RBIX.build.board=GENERIC_G081RBIX
GenG0.menu.pnum.GENERIC_G081RBIX.build.product_line=STM32G081xx
GenG0.menu.pnum.GENERIC_G081RBIX.build.variant=STM32G0xx/G071R(6-8)T_G071RB(I-T)_G081RB(I-T)

# Generic G081RBTx
GenG0.menu.pnum.GENERIC_G081RBTX=Generic G081RBTx
GenG0.menu.pnum.GENERIC_G081RBTX.upload.maximum_size=131072
GenG0.menu.pnum.GENERIC_G081RBTX.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G081RBTX.build.board=GENERIC_G081RBTX
GenG0.menu.pnum.GENERIC_G081RBTX.build.product_line=STM32G081xx
GenG0.menu.pnum.GENERIC_G081RBTX.build.variant=STM32G0xx/G071R(6-8)T_G071RB(I-T)_G081RB(I-T)

# Generic G0B0CETx
GenG0.menu.pnum.GENERIC_G0B0CETX=Generic G0B0CETx
GenG0.menu.pnum.GENERIC_G0B0CETX.upload.maximum_size=524288
GenG0.menu.pnum.GENERIC_G0B0CETX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0B0CETX.build.board=GENERIC_G0B0CETX
GenG0.menu.pnum.GENERIC_G0B0CETX.build.product_line=STM32G0B0xx
GenG0.menu.pnum.GENERIC_G0B0CETX.build.variant=STM32G0xx/G0B0CET

# Generic G0B0RETx
GenG0.menu.pnum.GENERIC_G0B0RETX=Generic G0B0RETx
GenG0.menu.pnum.GENERIC_G0B0RETX.upload.maximum_size=524288
GenG0.menu.pnum.GENERIC_G0B0RETX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0B0RETX.build.board=GENERIC_G0B0RETX
GenG0.menu.pnum.GENERIC_G0B0RETX.build.product_line=STM32G0B0xx
GenG0.menu.pnum.GENERIC_G0B0RETX.build.variant=STM32G0xx/G0B0RET

# Generic G0B0VETx
GenG0.menu.pnum.GENERIC_G0B0VETX=Generic G0B0VETx
GenG0.menu.pnum.GENERIC_G0B0VETX.upload.maximum_size=524288
GenG0.menu.pnum.GENERIC_G0B0VETX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0B0VETX.build.board=GENERIC_G0B0VETX
GenG0.menu.pnum.GENERIC_G0B0VETX.build.product_line=STM32G0B0xx
GenG0.menu.pnum.GENERIC_G0B0VETX.build.variant=STM32G0xx/G0B0VET

# Generic G0B1CBTx
GenG0.menu.pnum.GENERIC_G0B1CBTX=Generic G0B1CBTx
GenG0.menu.pnum.GENERIC_G0B1CBTX.upload.maximum_size=131072
GenG0.menu.pnum.GENERIC_G0B1CBTX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0B1CBTX.build.board=GENERIC_G0B1CBTX
GenG0.menu.pnum.GENERIC_G0B1CBTX.build.product_line=STM32G0B1xx
GenG0.menu.pnum.GENERIC_G0B1CBTX.build.variant=STM32G0xx/G0B1C(B-C-E)(T-U)_G0C1C(C-E)(T-U)

# Generic G0B1CCTx
GenG0.menu.pnum.GENERIC_G0B1CCTX=Generic G0B1CCTx
GenG0.menu.pnum.GENERIC_G0B1CCTX.upload.maximum_size=262144
GenG0.menu.pnum.GENERIC_G0B1CCTX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0B1CCTX.build.board=GENERIC_G0B1CCTX
GenG0.menu.pnum.GENERIC_G0B1CCTX.build.product_line=STM32G0B1xx
GenG0.menu.pnum.GENERIC_G0B1CCTX.build.variant=STM32G0xx/G0B1C(B-C-E)(T-U)_G0C1C(C-E)(T-U)

# Generic G0B1CETx
GenG0.menu.pnum.GENERIC_G0B1CETX=Generic G0B1CETx
GenG0.menu.pnum.GENERIC_G0B1CETX.upload.maximum_size=524288
GenG0.menu.pnum.GENERIC_G0B1CETX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0B1CETX.build.board=GENERIC_G0B1CETX
GenG0.menu.pnum.GENERIC_G0B1CETX.build.product_line=STM32G0B1xx
GenG0.menu.pnum.GENERIC_G0B1CETX.build.variant=STM32G0xx/G0B1C(B-C-E)(T-U)_G0C1C(C-E)(T-U)

# Generic G0B1CBUx
GenG0.menu.pnum.GENERIC_G0B1CBUX=Generic G0B1CBUx
GenG0.menu.pnum.GENERIC_G0B1CBUX.upload.maximum_size=131072
GenG0.menu.pnum.GENERIC_G0B1CBUX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0B1CBUX.build.board=GENERIC_G0B1CBUX
GenG0.menu.pnum.GENERIC_G0B1CBUX.build.product_line=STM32G0B1xx
GenG0.menu.pnum.GENERIC_G0B1CBUX.build.variant=STM32G0xx/G0B1C(B-C-E)(T-U)_G0C1C(C-E)(T-U)

# Generic G0B1CCUx
GenG0.menu.pnum.GENERIC_G0B1CCUX=Generic G0B1CCUx
GenG0.menu.pnum.GENERIC_G0B1CCUX.upload.maximum_size=262144
GenG0.menu.pnum.GENERIC_G0B1CCUX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0B1CCUX.build.board=GENERIC_G0B1CCUX
GenG0.menu.pnum.GENERIC_G0B1CCUX.build.product_line=STM32G0B1xx
GenG0.menu.pnum.GENERIC_G0B1CCUX.build.variant=STM32G0xx/G0B1C(B-C-E)(T-U)_G0C1C(C-E)(T-U)

