chcbaram/CODING_SOGUL_STM32/boards.txt
# Generic G0B1CEUx
GenG0.menu.pnum.GENERIC_G0B1CEUX=Generic G0B1CEUx
GenG0.menu.pnum.GENERIC_G0B1CEUX.upload.maximum_size=524288
GenG0.menu.pnum.GENERIC_G0B1CEUX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0B1CEUX.build.board=GENERIC_G0B1CEUX
GenG0.menu.pnum.GENERIC_G0B1CEUX.build.product_line=STM32G0B1xx
GenG0.menu.pnum.GENERIC_G0B1CEUX.build.variant=STM32G0xx/G0B1C(B-C-E)(T-U)_G0C1C(C-E)(T-U)

# Generic G0B1KBTx
GenG0.menu.pnum.GENERIC_G0B1KBTX=Generic G0B1KBTx
GenG0.menu.pnum.GENERIC_G0B1KBTX.upload.maximum_size=131072
GenG0.menu.pnum.GENERIC_G0B1KBTX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0B1KBTX.build.board=GENERIC_G0B1KBTX
GenG0.menu.pnum.GENERIC_G0B1KBTX.build.product_line=STM32G0B1xx
GenG0.menu.pnum.GENERIC_G0B1KBTX.build.variant=STM32G0xx/G0B1K(B-C-E)(T-U)_G0C1K(C-E)(T-U)

# Generic G0B1KCTx
GenG0.menu.pnum.GENERIC_G0B1KCTX=Generic G0B1KCTx
GenG0.menu.pnum.GENERIC_G0B1KCTX.upload.maximum_size=262144
GenG0.menu.pnum.GENERIC_G0B1KCTX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0B1KCTX.build.board=GENERIC_G0B1KCTX
GenG0.menu.pnum.GENERIC_G0B1KCTX.build.product_line=STM32G0B1xx
GenG0.menu.pnum.GENERIC_G0B1KCTX.build.variant=STM32G0xx/G0B1K(B-C-E)(T-U)_G0C1K(C-E)(T-U)

# Generic G0B1KETx
GenG0.menu.pnum.GENERIC_G0B1KETX=Generic G0B1KETx
GenG0.menu.pnum.GENERIC_G0B1KETX.upload.maximum_size=524288
GenG0.menu.pnum.GENERIC_G0B1KETX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0B1KETX.build.board=GENERIC_G0B1KETX
GenG0.menu.pnum.GENERIC_G0B1KETX.build.product_line=STM32G0B1xx
GenG0.menu.pnum.GENERIC_G0B1KETX.build.variant=STM32G0xx/G0B1K(B-C-E)(T-U)_G0C1K(C-E)(T-U)

# Generic G0B1KBUx
GenG0.menu.pnum.GENERIC_G0B1KBUX=Generic G0B1KBUx
GenG0.menu.pnum.GENERIC_G0B1KBUX.upload.maximum_size=131072
GenG0.menu.pnum.GENERIC_G0B1KBUX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0B1KBUX.build.board=GENERIC_G0B1KBUX
GenG0.menu.pnum.GENERIC_G0B1KBUX.build.product_line=STM32G0B1xx
GenG0.menu.pnum.GENERIC_G0B1KBUX.build.variant=STM32G0xx/G0B1K(B-C-E)(T-U)_G0C1K(C-E)(T-U)

# Generic G0B1KCUx
GenG0.menu.pnum.GENERIC_G0B1KCUX=Generic G0B1KCUx
GenG0.menu.pnum.GENERIC_G0B1KCUX.upload.maximum_size=262144
GenG0.menu.pnum.GENERIC_G0B1KCUX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0B1KCUX.build.board=GENERIC_G0B1KCUX
GenG0.menu.pnum.GENERIC_G0B1KCUX.build.product_line=STM32G0B1xx
GenG0.menu.pnum.GENERIC_G0B1KCUX.build.variant=STM32G0xx/G0B1K(B-C-E)(T-U)_G0C1K(C-E)(T-U)

# Generic G0B1KEUx
GenG0.menu.pnum.GENERIC_G0B1KEUX=Generic G0B1KEUx
GenG0.menu.pnum.GENERIC_G0B1KEUX.upload.maximum_size=524288
GenG0.menu.pnum.GENERIC_G0B1KEUX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0B1KEUX.build.board=GENERIC_G0B1KEUX
GenG0.menu.pnum.GENERIC_G0B1KEUX.build.product_line=STM32G0B1xx
GenG0.menu.pnum.GENERIC_G0B1KEUX.build.variant=STM32G0xx/G0B1K(B-C-E)(T-U)_G0C1K(C-E)(T-U)

# Generic G0C1KCTx
GenG0.menu.pnum.GENERIC_G0C1KCTX=Generic G0C1KCTx
GenG0.menu.pnum.GENERIC_G0C1KCTX.upload.maximum_size=262144
GenG0.menu.pnum.GENERIC_G0C1KCTX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0C1KCTX.build.board=GENERIC_G0C1KCTX
GenG0.menu.pnum.GENERIC_G0C1KCTX.build.product_line=STM32G0C1xx
GenG0.menu.pnum.GENERIC_G0C1KCTX.build.variant=STM32G0xx/G0B1K(B-C-E)(T-U)_G0C1K(C-E)(T-U)

# Generic G0C1KETx
GenG0.menu.pnum.GENERIC_G0C1KETX=Generic G0C1KETx
GenG0.menu.pnum.GENERIC_G0C1KETX.upload.maximum_size=524288
GenG0.menu.pnum.GENERIC_G0C1KETX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0C1KETX.build.board=GENERIC_G0C1KETX
GenG0.menu.pnum.GENERIC_G0C1KETX.build.product_line=STM32G0C1xx
GenG0.menu.pnum.GENERIC_G0C1KETX.build.variant=STM32G0xx/G0B1K(B-C-E)(T-U)_G0C1K(C-E)(T-U)

# Generic G0C1KCUx
GenG0.menu.pnum.GENERIC_G0C1KCUX=Generic G0C1KCUx
GenG0.menu.pnum.GENERIC_G0C1KCUX.upload.maximum_size=262144
GenG0.menu.pnum.GENERIC_G0C1KCUX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0C1KCUX.build.board=GENERIC_G0C1KCUX
GenG0.menu.pnum.GENERIC_G0C1KCUX.build.product_line=STM32G0C1xx
GenG0.menu.pnum.GENERIC_G0C1KCUX.build.variant=STM32G0xx/G0B1K(B-C-E)(T-U)_G0C1K(C-E)(T-U)

# Generic G0C1KEUx
GenG0.menu.pnum.GENERIC_G0C1KEUX=Generic G0C1KEUx
GenG0.menu.pnum.GENERIC_G0C1KEUX.upload.maximum_size=524288
GenG0.menu.pnum.GENERIC_G0C1KEUX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0C1KEUX.build.board=GENERIC_G0C1KEUX
GenG0.menu.pnum.GENERIC_G0C1KEUX.build.product_line=STM32G0C1xx
GenG0.menu.pnum.GENERIC_G0C1KEUX.build.variant=STM32G0xx/G0B1K(B-C-E)(T-U)_G0C1K(C-E)(T-U)

# Generic G0B1MBTx
GenG0.menu.pnum.GENERIC_G0B1MBTX=Generic G0B1MBTx
GenG0.menu.pnum.GENERIC_G0B1MBTX.upload.maximum_size=131072
GenG0.menu.pnum.GENERIC_G0B1MBTX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0B1MBTX.build.board=GENERIC_G0B1MBTX
GenG0.menu.pnum.GENERIC_G0B1MBTX.build.product_line=STM32G0B1xx
GenG0.menu.pnum.GENERIC_G0B1MBTX.build.variant=STM32G0xx/G0B1M(B-C-E)T_G0C1M(C-E)T

# Generic G0B1MCTx
GenG0.menu.pnum.GENERIC_G0B1MCTX=Generic G0B1MCTx
GenG0.menu.pnum.GENERIC_G0B1MCTX.upload.maximum_size=262144
GenG0.menu.pnum.GENERIC_G0B1MCTX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0B1MCTX.build.board=GENERIC_G0B1MCTX
GenG0.menu.pnum.GENERIC_G0B1MCTX.build.product_line=STM32G0B1xx
GenG0.menu.pnum.GENERIC_G0B1MCTX.build.variant=STM32G0xx/G0B1M(B-C-E)T_G0C1M(C-E)T

# Generic G0B1METx
GenG0.menu.pnum.GENERIC_G0B1METX=Generic G0B1METx
GenG0.menu.pnum.GENERIC_G0B1METX.upload.maximum_size=524288
GenG0.menu.pnum.GENERIC_G0B1METX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0B1METX.build.board=GENERIC_G0B1METX
GenG0.menu.pnum.GENERIC_G0B1METX.build.product_line=STM32G0B1xx
GenG0.menu.pnum.GENERIC_G0B1METX.build.variant=STM32G0xx/G0B1M(B-C-E)T_G0C1M(C-E)T

# Generic G0C1MCTx
GenG0.menu.pnum.GENERIC_G0C1MCTX=Generic G0C1MCTx
GenG0.menu.pnum.GENERIC_G0C1MCTX.upload.maximum_size=262144
GenG0.menu.pnum.GENERIC_G0C1MCTX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0C1MCTX.build.board=GENERIC_G0C1MCTX
GenG0.menu.pnum.GENERIC_G0C1MCTX.build.product_line=STM32G0C1xx
GenG0.menu.pnum.GENERIC_G0C1MCTX.build.variant=STM32G0xx/G0B1M(B-C-E)T_G0C1M(C-E)T

# Generic G0C1METx
GenG0.menu.pnum.GENERIC_G0C1METX=Generic G0C1METx
GenG0.menu.pnum.GENERIC_G0C1METX.upload.maximum_size=524288
GenG0.menu.pnum.GENERIC_G0C1METX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0C1METX.build.board=GENERIC_G0C1METX
GenG0.menu.pnum.GENERIC_G0C1METX.build.product_line=STM32G0C1xx
GenG0.menu.pnum.GENERIC_G0C1METX.build.variant=STM32G0xx/G0B1M(B-C-E)T_G0C1M(C-E)T

# Generic G0B1NEYx
GenG0.menu.pnum.GENERIC_G0B1NEYX=Generic G0B1NEYx
GenG0.menu.pnum.GENERIC_G0B1NEYX.upload.maximum_size=524288
GenG0.menu.pnum.GENERIC_G0B1NEYX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0B1NEYX.build.board=GENERIC_G0B1NEYX
GenG0.menu.pnum.GENERIC_G0B1NEYX.build.product_line=STM32G0B1xx
GenG0.menu.pnum.GENERIC_G0B1NEYX.build.variant=STM32G0xx/G0B1NEY_G0C1NEY

