chcbaram/CODING_SOGUL_STM32/boards.txt
# Generic L041C4Tx
GenL0.menu.pnum.GENERIC_L041C4TX=Generic L041C4Tx
GenL0.menu.pnum.GENERIC_L041C4TX.upload.maximum_size=16384
GenL0.menu.pnum.GENERIC_L041C4TX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L041C4TX.build.board=GENERIC_L041C4TX
GenL0.menu.pnum.GENERIC_L041C4TX.build.product_line=STM32L041xx
GenL0.menu.pnum.GENERIC_L041C4TX.build.variant=STM32L0xx/L031C(4-6)(T-U)_L041C4T_L041C6(T-U)

# Generic L041C6Tx
GenL0.menu.pnum.GENERIC_L041C6TX=Generic L041C6Tx
GenL0.menu.pnum.GENERIC_L041C6TX.upload.maximum_size=32768
GenL0.menu.pnum.GENERIC_L041C6TX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L041C6TX.build.board=GENERIC_L041C6TX
GenL0.menu.pnum.GENERIC_L041C6TX.build.product_line=STM32L041xx
GenL0.menu.pnum.GENERIC_L041C6TX.build.variant=STM32L0xx/L031C(4-6)(T-U)_L041C4T_L041C6(T-U)

# Generic L041C6Ux
GenL0.menu.pnum.GENERIC_L041C6UX=Generic L041C6Ux
GenL0.menu.pnum.GENERIC_L041C6UX.upload.maximum_size=32768
GenL0.menu.pnum.GENERIC_L041C6UX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L041C6UX.build.board=GENERIC_L041C6UX
GenL0.menu.pnum.GENERIC_L041C6UX.build.product_line=STM32L041xx
GenL0.menu.pnum.GENERIC_L041C6UX.build.variant=STM32L0xx/L031C(4-6)(T-U)_L041C4T_L041C6(T-U)

# Generic L041E6Yx
GenL0.menu.pnum.GENERIC_L041E6YX=Generic L041E6Yx
GenL0.menu.pnum.GENERIC_L041E6YX.upload.maximum_size=32768
GenL0.menu.pnum.GENERIC_L041E6YX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L041E6YX.build.board=GENERIC_L041E6YX
GenL0.menu.pnum.GENERIC_L041E6YX.build.product_line=STM32L041xx
GenL0.menu.pnum.GENERIC_L041E6YX.build.variant=STM32L0xx/L031E(4-6)Y_L041E6Y

# Generic L041F6Px
GenL0.menu.pnum.GENERIC_L041F6PX=Generic L041F6Px
GenL0.menu.pnum.GENERIC_L041F6PX.upload.maximum_size=32768
GenL0.menu.pnum.GENERIC_L041F6PX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L041F6PX.build.board=GENERIC_L041F6PX
GenL0.menu.pnum.GENERIC_L041F6PX.build.product_line=STM32L041xx
GenL0.menu.pnum.GENERIC_L041F6PX.build.variant=STM32L0xx/L031F(4-6)P_L041F6P

# Generic L041G6Ux
GenL0.menu.pnum.GENERIC_L041G6UX=Generic L041G6Ux
GenL0.menu.pnum.GENERIC_L041G6UX.upload.maximum_size=32768
GenL0.menu.pnum.GENERIC_L041G6UX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L041G6UX.build.board=GENERIC_L041G6UX
GenL0.menu.pnum.GENERIC_L041G6UX.build.product_line=STM32L041xx
GenL0.menu.pnum.GENERIC_L041G6UX.build.variant=STM32L0xx/L031G(4-6)U_L041G6U

# Generic L041K6Tx
GenL0.menu.pnum.GENERIC_L041K6TX=Generic L041K6Tx
GenL0.menu.pnum.GENERIC_L041K6TX.upload.maximum_size=32768
GenL0.menu.pnum.GENERIC_L041K6TX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L041K6TX.build.board=GENERIC_L041K6TX
GenL0.menu.pnum.GENERIC_L041K6TX.build.product_line=STM32L041xx
GenL0.menu.pnum.GENERIC_L041K6TX.build.variant=STM32L0xx/L031K(4-6)T_L041K6T

# Generic L051C6Tx
GenL0.menu.pnum.GENERIC_L051C6TX=Generic L051C6Tx
GenL0.menu.pnum.GENERIC_L051C6TX.upload.maximum_size=32768
GenL0.menu.pnum.GENERIC_L051C6TX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L051C6TX.build.board=GENERIC_L051C6TX
GenL0.menu.pnum.GENERIC_L051C6TX.build.product_line=STM32L051xx
GenL0.menu.pnum.GENERIC_L051C6TX.build.variant=STM32L0xx/L051C(6-8)(T-U)

# Generic L051C6Ux
GenL0.menu.pnum.GENERIC_L051C6UX=Generic L051C6Ux
GenL0.menu.pnum.GENERIC_L051C6UX.upload.maximum_size=32768
GenL0.menu.pnum.GENERIC_L051C6UX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L051C6UX.build.board=GENERIC_L051C6UX
GenL0.menu.pnum.GENERIC_L051C6UX.build.product_line=STM32L051xx
GenL0.menu.pnum.GENERIC_L051C6UX.build.variant=STM32L0xx/L051C(6-8)(T-U)

# Generic L051C8Tx
GenL0.menu.pnum.GENERIC_L051C8TX=Generic L051C8Tx
GenL0.menu.pnum.GENERIC_L051C8TX.upload.maximum_size=65536
GenL0.menu.pnum.GENERIC_L051C8TX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L051C8TX.build.board=GENERIC_L051C8TX
GenL0.menu.pnum.GENERIC_L051C8TX.build.product_line=STM32L051xx
GenL0.menu.pnum.GENERIC_L051C8TX.build.variant=STM32L0xx/L051C(6-8)(T-U)

# Generic L051C8Ux
GenL0.menu.pnum.GENERIC_L051C8UX=Generic L051C8Ux
GenL0.menu.pnum.GENERIC_L051C8UX.upload.maximum_size=65536
GenL0.menu.pnum.GENERIC_L051C8UX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L051C8UX.build.board=GENERIC_L051C8UX
GenL0.menu.pnum.GENERIC_L051C8UX.build.product_line=STM32L051xx
GenL0.menu.pnum.GENERIC_L051C8UX.build.variant=STM32L0xx/L051C(6-8)(T-U)

# Generic L052C6Tx
GenL0.menu.pnum.GENERIC_L052C6TX=Generic L052C6Tx
GenL0.menu.pnum.GENERIC_L052C6TX.upload.maximum_size=32768
GenL0.menu.pnum.GENERIC_L052C6TX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L052C6TX.build.board=GENERIC_L052C6TX
GenL0.menu.pnum.GENERIC_L052C6TX.build.product_line=STM32L052xx
GenL0.menu.pnum.GENERIC_L052C6TX.build.variant=STM32L0xx/L052C(6-8)(T-U)_L053C(6-8)(T-U)_L062C8U_L063C8(T-U)

# Generic L052C8Tx
GenL0.menu.pnum.GENERIC_L052C8TX=Generic L052C8Tx
GenL0.menu.pnum.GENERIC_L052C8TX.upload.maximum_size=65536
GenL0.menu.pnum.GENERIC_L052C8TX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L052C8TX.build.board=GENERIC_L052C8TX
GenL0.menu.pnum.GENERIC_L052C8TX.build.product_line=STM32L052xx
GenL0.menu.pnum.GENERIC_L052C8TX.build.variant=STM32L0xx/L052C(6-8)(T-U)_L053C(6-8)(T-U)_L062C8U_L063C8(T-U)

# Generic L052C6Ux
GenL0.menu.pnum.GENERIC_L052C6UX=Generic L052C6Ux
GenL0.menu.pnum.GENERIC_L052C6UX.upload.maximum_size=32768
GenL0.menu.pnum.GENERIC_L052C6UX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L052C6UX.build.board=GENERIC_L052C6UX
GenL0.menu.pnum.GENERIC_L052C6UX.build.product_line=STM32L052xx
GenL0.menu.pnum.GENERIC_L052C6UX.build.variant=STM32L0xx/L052C(6-8)(T-U)_L053C(6-8)(T-U)_L062C8U_L063C8(T-U)

# Generic L052C8Ux
GenL0.menu.pnum.GENERIC_L052C8UX=Generic L052C8Ux
GenL0.menu.pnum.GENERIC_L052C8UX.upload.maximum_size=65536
GenL0.menu.pnum.GENERIC_L052C8UX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L052C8UX.build.board=GENERIC_L052C8UX
GenL0.menu.pnum.GENERIC_L052C8UX.build.product_line=STM32L052xx
GenL0.menu.pnum.GENERIC_L052C8UX.build.variant=STM32L0xx/L052C(6-8)(T-U)_L053C(6-8)(T-U)_L062C8U_L063C8(T-U)

