chcbaram/CODING_SOGUL_STM32/boards.txt
# Generic L452RETxP
GenL4.menu.pnum.GENERIC_L452RETXP=Generic L452RETxP
GenL4.menu.pnum.GENERIC_L452RETXP.upload.maximum_size=524288
GenL4.menu.pnum.GENERIC_L452RETXP.upload.maximum_data_size=163840
GenL4.menu.pnum.GENERIC_L452RETXP.build.board=GENERIC_L452RETXP
GenL4.menu.pnum.GENERIC_L452RETXP.build.product_line=STM32L452xx
GenL4.menu.pnum.GENERIC_L452RETXP.build.variant=STM32L4xx/L452RETxP

# Generic L462REIx
GenL4.menu.pnum.GENERIC_L462REIX=Generic L462REIx
GenL4.menu.pnum.GENERIC_L462REIX.upload.maximum_size=524288
GenL4.menu.pnum.GENERIC_L462REIX.upload.maximum_data_size=163840
GenL4.menu.pnum.GENERIC_L462REIX.build.board=GENERIC_L462REIX
GenL4.menu.pnum.GENERIC_L462REIX.build.product_line=STM32L462xx
GenL4.menu.pnum.GENERIC_L462REIX.build.variant=STM32L4xx/L452RC(I-T-Y)_L452RE(I-T-Y)x(P)_L462RE(I-T-Y)

# Generic L462RETx
GenL4.menu.pnum.GENERIC_L462RETX=Generic L462RETx
GenL4.menu.pnum.GENERIC_L462RETX.upload.maximum_size=524288
GenL4.menu.pnum.GENERIC_L462RETX.upload.maximum_data_size=163840
GenL4.menu.pnum.GENERIC_L462RETX.build.board=GENERIC_L462RETX
GenL4.menu.pnum.GENERIC_L462RETX.build.product_line=STM32L462xx
GenL4.menu.pnum.GENERIC_L462RETX.build.variant=STM32L4xx/L452RC(I-T-Y)_L452RE(I-T-Y)x(P)_L462RE(I-T-Y)

# Generic L462REYx
GenL4.menu.pnum.GENERIC_L462REYX=Generic L462REYx
GenL4.menu.pnum.GENERIC_L462REYX.upload.maximum_size=524288
GenL4.menu.pnum.GENERIC_L462REYX.upload.maximum_data_size=163840
GenL4.menu.pnum.GENERIC_L462REYX.build.board=GENERIC_L462REYX
GenL4.menu.pnum.GENERIC_L462REYX.build.product_line=STM32L462xx
GenL4.menu.pnum.GENERIC_L462REYX.build.variant=STM32L4xx/L452RC(I-T-Y)_L452RE(I-T-Y)x(P)_L462RE(I-T-Y)

# Generic L475RCTx
GenL4.menu.pnum.GENERIC_L475RCTX=Generic L475RCTx
GenL4.menu.pnum.GENERIC_L475RCTX.upload.maximum_size=262144
GenL4.menu.pnum.GENERIC_L475RCTX.upload.maximum_data_size=98304
GenL4.menu.pnum.GENERIC_L475RCTX.build.board=GENERIC_L475RCTX
GenL4.menu.pnum.GENERIC_L475RCTX.build.product_line=STM32L475xx
GenL4.menu.pnum.GENERIC_L475RCTX.build.variant=STM32L4xx/L475R(C-E-G)T_L476R(C-E-G)T_L486RGT

# Generic L475RETx
GenL4.menu.pnum.GENERIC_L475RETX=Generic L475RETx
GenL4.menu.pnum.GENERIC_L475RETX.upload.maximum_size=524288
GenL4.menu.pnum.GENERIC_L475RETX.upload.maximum_data_size=98304
GenL4.menu.pnum.GENERIC_L475RETX.build.board=GENERIC_L475RETX
GenL4.menu.pnum.GENERIC_L475RETX.build.product_line=STM32L475xx
GenL4.menu.pnum.GENERIC_L475RETX.build.variant=STM32L4xx/L475R(C-E-G)T_L476R(C-E-G)T_L486RGT

# Generic L475RGTx
GenL4.menu.pnum.GENERIC_L475RGTX=Generic L475RGTx
GenL4.menu.pnum.GENERIC_L475RGTX.upload.maximum_size=1048576
GenL4.menu.pnum.GENERIC_L475RGTX.upload.maximum_data_size=98304
GenL4.menu.pnum.GENERIC_L475RGTX.build.board=GENERIC_L475RGTX
GenL4.menu.pnum.GENERIC_L475RGTX.build.product_line=STM32L475xx
GenL4.menu.pnum.GENERIC_L475RGTX.build.variant=STM32L4xx/L475R(C-E-G)T_L476R(C-E-G)T_L486RGT

# Generic L475VCTx
GenL4.menu.pnum.GENERIC_L475VCTX=Generic L475VCTx
GenL4.menu.pnum.GENERIC_L475VCTX.upload.maximum_size=262144
GenL4.menu.pnum.GENERIC_L475VCTX.upload.maximum_data_size=98304
GenL4.menu.pnum.GENERIC_L475VCTX.build.board=GENERIC_L475VCTX
GenL4.menu.pnum.GENERIC_L475VCTX.build.product_line=STM32L475xx
GenL4.menu.pnum.GENERIC_L475VCTX.build.variant=STM32L4xx/L475V(C-E-G)T_L476V(C-E-G)T_L486VGT

# Generic L475VETx
GenL4.menu.pnum.GENERIC_L475VETX=Generic L475VETx
GenL4.menu.pnum.GENERIC_L475VETX.upload.maximum_size=524288
GenL4.menu.pnum.GENERIC_L475VETX.upload.maximum_data_size=98304
GenL4.menu.pnum.GENERIC_L475VETX.build.board=GENERIC_L475VETX
GenL4.menu.pnum.GENERIC_L475VETX.build.product_line=STM32L475xx
GenL4.menu.pnum.GENERIC_L475VETX.build.variant=STM32L4xx/L475V(C-E-G)T_L476V(C-E-G)T_L486VGT

# Generic L475VGTx
GenL4.menu.pnum.GENERIC_L475VGTX=Generic L475VGTx
GenL4.menu.pnum.GENERIC_L475VGTX.upload.maximum_size=1048576
GenL4.menu.pnum.GENERIC_L475VGTX.upload.maximum_data_size=98304
GenL4.menu.pnum.GENERIC_L475VGTX.build.board=GENERIC_L475VGTX
GenL4.menu.pnum.GENERIC_L475VGTX.build.product_line=STM32L475xx
GenL4.menu.pnum.GENERIC_L475VGTX.build.variant=STM32L4xx/L475V(C-E-G)T_L476V(C-E-G)T_L486VGT

# Generic L476RCTx
GenL4.menu.pnum.GENERIC_L476RCTX=Generic L476RCTx
GenL4.menu.pnum.GENERIC_L476RCTX.upload.maximum_size=262144
GenL4.menu.pnum.GENERIC_L476RCTX.upload.maximum_data_size=98304
GenL4.menu.pnum.GENERIC_L476RCTX.build.board=GENERIC_L476RCTX
GenL4.menu.pnum.GENERIC_L476RCTX.build.product_line=STM32L476xx
GenL4.menu.pnum.GENERIC_L476RCTX.build.variant=STM32L4xx/L475R(C-E-G)T_L476R(C-E-G)T_L486RGT

# Generic L476RETx
GenL4.menu.pnum.GENERIC_L476RETX=Generic L476RETx
GenL4.menu.pnum.GENERIC_L476RETX.upload.maximum_size=524288
GenL4.menu.pnum.GENERIC_L476RETX.upload.maximum_data_size=98304
GenL4.menu.pnum.GENERIC_L476RETX.build.board=GENERIC_L476RETX
GenL4.menu.pnum.GENERIC_L476RETX.build.product_line=STM32L476xx
GenL4.menu.pnum.GENERIC_L476RETX.build.variant=STM32L4xx/L475R(C-E-G)T_L476R(C-E-G)T_L486RGT

# Generic L476RGTx
GenL4.menu.pnum.GENERIC_L476RGTX=Generic L476RGTx
GenL4.menu.pnum.GENERIC_L476RGTX.upload.maximum_size=1048576
GenL4.menu.pnum.GENERIC_L476RGTX.upload.maximum_data_size=98304
GenL4.menu.pnum.GENERIC_L476RGTX.build.board=GENERIC_L476RGTX
GenL4.menu.pnum.GENERIC_L476RGTX.build.product_line=STM32L476xx
GenL4.menu.pnum.GENERIC_L476RGTX.build.variant=STM32L4xx/L475R(C-E-G)T_L476R(C-E-G)T_L486RGT

# Generic L476VCTx
GenL4.menu.pnum.GENERIC_L476VCTX=Generic L476VCTx
GenL4.menu.pnum.GENERIC_L476VCTX.upload.maximum_size=262144
GenL4.menu.pnum.GENERIC_L476VCTX.upload.maximum_data_size=98304
GenL4.menu.pnum.GENERIC_L476VCTX.build.board=GENERIC_L476VCTX
GenL4.menu.pnum.GENERIC_L476VCTX.build.product_line=STM32L476xx
GenL4.menu.pnum.GENERIC_L476VCTX.build.variant=STM32L4xx/L475V(C-E-G)T_L476V(C-E-G)T_L486VGT

# Generic L476VETx
GenL4.menu.pnum.GENERIC_L476VETX=Generic L476VETx
GenL4.menu.pnum.GENERIC_L476VETX.upload.maximum_size=524288
GenL4.menu.pnum.GENERIC_L476VETX.upload.maximum_data_size=98304
GenL4.menu.pnum.GENERIC_L476VETX.build.board=GENERIC_L476VETX
GenL4.menu.pnum.GENERIC_L476VETX.build.product_line=STM32L476xx
GenL4.menu.pnum.GENERIC_L476VETX.build.variant=STM32L4xx/L475V(C-E-G)T_L476V(C-E-G)T_L486VGT

# Generic L476VGTx
GenL4.menu.pnum.GENERIC_L476VGTX=Generic L476VGTx
GenL4.menu.pnum.GENERIC_L476VGTX.upload.maximum_size=1048576
GenL4.menu.pnum.GENERIC_L476VGTX.upload.maximum_data_size=98304
GenL4.menu.pnum.GENERIC_L476VGTX.build.board=GENERIC_L476VGTX
GenL4.menu.pnum.GENERIC_L476VGTX.build.product_line=STM32L476xx
GenL4.menu.pnum.GENERIC_L476VGTX.build.variant=STM32L4xx/L475V(C-E-G)T_L476V(C-E-G)T_L486VGT

# Generic L486RGTx
GenL4.menu.pnum.GENERIC_L486RGTX=Generic L486RGTx
GenL4.menu.pnum.GENERIC_L486RGTX.upload.maximum_size=1048576
GenL4.menu.pnum.GENERIC_L486RGTX.upload.maximum_data_size=98304
GenL4.menu.pnum.GENERIC_L486RGTX.build.board=GENERIC_L486RGTX
GenL4.menu.pnum.GENERIC_L486RGTX.build.product_line=STM32L486xx
GenL4.menu.pnum.GENERIC_L486RGTX.build.variant=STM32L4xx/L475R(C-E-G)T_L476R(C-E-G)T_L486RGT

