chcbaram/CODING_SOGUL_STM32/boards.txt
Nucleo_64.menu.opt.osstd=Smallest (-Os default)
Nucleo_64.menu.opt.oslto=Smallest (-Os) with LTO
Nucleo_64.menu.opt.oslto.build.flags.optimize=-Os -flto
Nucleo_64.menu.opt.o1std=Fast (-O1)
Nucleo_64.menu.opt.o1std.build.flags.optimize=-O1
Nucleo_64.menu.opt.o1lto=Fast (-O1) with LTO
Nucleo_64.menu.opt.o1lto.build.flags.optimize=-O1 -flto
Nucleo_64.menu.opt.o2std=Faster (-O2)
Nucleo_64.menu.opt.o2std.build.flags.optimize=-O2
Nucleo_64.menu.opt.o2lto=Faster (-O2) with LTO
Nucleo_64.menu.opt.o2lto.build.flags.optimize=-O2 -flto
Nucleo_64.menu.opt.o3std=Fastest (-O3)
Nucleo_64.menu.opt.o3std.build.flags.optimize=-O3
Nucleo_64.menu.opt.o3lto=Fastest (-O3) with LTO
Nucleo_64.menu.opt.o3lto.build.flags.optimize=-O3 -flto
Nucleo_64.menu.opt.ogstd=Debug (-Og)
Nucleo_64.menu.opt.ogstd.build.flags.optimize=-Og
Nucleo_64.menu.opt.o0std=No Optimization (-O0)
Nucleo_64.menu.opt.o0std.build.flags.optimize=-O0

Nucleo_32.menu.opt.osstd=Smallest (-Os default)
Nucleo_32.menu.opt.oslto=Smallest (-Os) with LTO
Nucleo_32.menu.opt.oslto.build.flags.optimize=-Os -flto
Nucleo_32.menu.opt.o1std=Fast (-O1)
Nucleo_32.menu.opt.o1std.build.flags.optimize=-O1
Nucleo_32.menu.opt.o1lto=Fast (-O1) with LTO
Nucleo_32.menu.opt.o1lto.build.flags.optimize=-O1 -flto
Nucleo_32.menu.opt.o2std=Faster (-O2)
Nucleo_32.menu.opt.o2std.build.flags.optimize=-O2
Nucleo_32.menu.opt.o2lto=Faster (-O2) with LTO
Nucleo_32.menu.opt.o2lto.build.flags.optimize=-O2 -flto
Nucleo_32.menu.opt.o3std=Fastest (-O3)
Nucleo_32.menu.opt.o3std.build.flags.optimize=-O3
Nucleo_32.menu.opt.o3lto=Fastest (-O3) with LTO
Nucleo_32.menu.opt.o3lto.build.flags.optimize=-O3 -flto
Nucleo_32.menu.opt.ogstd=Debug (-Og)
Nucleo_32.menu.opt.ogstd.build.flags.optimize=-Og
Nucleo_32.menu.opt.o0std=No Optimization (-O0)
Nucleo_32.menu.opt.o0std.build.flags.optimize=-O0

Disco.menu.opt.osstd=Smallest (-Os default)
Disco.menu.opt.oslto=Smallest (-Os) with LTO
Disco.menu.opt.oslto.build.flags.optimize=-Os -flto
Disco.menu.opt.o1std=Fast (-O1)
Disco.menu.opt.o1std.build.flags.optimize=-O1
Disco.menu.opt.o1lto=Fast (-O1) with LTO
Disco.menu.opt.o1lto.build.flags.optimize=-O1 -flto
Disco.menu.opt.o2std=Faster (-O2)
Disco.menu.opt.o2std.build.flags.optimize=-O2
Disco.menu.opt.o2lto=Faster (-O2) with LTO
Disco.menu.opt.o2lto.build.flags.optimize=-O2 -flto
Disco.menu.opt.o3std=Fastest (-O3)
Disco.menu.opt.o3std.build.flags.optimize=-O3
Disco.menu.opt.o3lto=Fastest (-O3) with LTO
Disco.menu.opt.o3lto.build.flags.optimize=-O3 -flto
Disco.menu.opt.ogstd=Debug (-Og)
Disco.menu.opt.ogstd.build.flags.optimize=-Og
Disco.menu.opt.o0std=No Optimization (-O0)
Disco.menu.opt.o0std.build.flags.optimize=-O0

Eval.menu.opt.osstd=Smallest (-Os default)
Eval.menu.opt.oslto=Smallest (-Os) with LTO
Eval.menu.opt.oslto.build.flags.optimize=-Os -flto
Eval.menu.opt.o1std=Fast (-O1)
Eval.menu.opt.o1std.build.flags.optimize=-O1
Eval.menu.opt.o1lto=Fast (-O1) with LTO
Eval.menu.opt.o1lto.build.flags.optimize=-O1 -flto
Eval.menu.opt.o2std=Faster (-O2)
Eval.menu.opt.o2std.build.flags.optimize=-O2
Eval.menu.opt.o2lto=Faster (-O2) with LTO
Eval.menu.opt.o2lto.build.flags.optimize=-O2 -flto
Eval.menu.opt.o3std=Fastest (-O3)
Eval.menu.opt.o3std.build.flags.optimize=-O3
Eval.menu.opt.o3lto=Fastest (-O3) with LTO
Eval.menu.opt.o3lto.build.flags.optimize=-O3 -flto
Eval.menu.opt.ogstd=Debug (-Og)
Eval.menu.opt.ogstd.build.flags.optimize=-Og
Eval.menu.opt.o0std=No Optimization (-O0)
Eval.menu.opt.o0std.build.flags.optimize=-O0

GenC0.menu.opt.osstd=Smallest (-Os default)
GenC0.menu.opt.oslto=Smallest (-Os) with LTO
GenC0.menu.opt.oslto.build.flags.optimize=-Os -flto
GenC0.menu.opt.o1std=Fast (-O1)
GenC0.menu.opt.o1std.build.flags.optimize=-O1
GenC0.menu.opt.o1lto=Fast (-O1) with LTO
GenC0.menu.opt.o1lto.build.flags.optimize=-O1 -flto
GenC0.menu.opt.o2std=Faster (-O2)
GenC0.menu.opt.o2std.build.flags.optimize=-O2
GenC0.menu.opt.o2lto=Faster (-O2) with LTO
GenC0.menu.opt.o2lto.build.flags.optimize=-O2 -flto
GenC0.menu.opt.o3std=Fastest (-O3)
GenC0.menu.opt.o3std.build.flags.optimize=-O3
GenC0.menu.opt.o3lto=Fastest (-O3) with LTO
GenC0.menu.opt.o3lto.build.flags.optimize=-O3 -flto
GenC0.menu.opt.ogstd=Debug (-Og)
GenC0.menu.opt.ogstd.build.flags.optimize=-Og

GenF0.menu.opt.osstd=Smallest (-Os default)
GenF0.menu.opt.oslto=Smallest (-Os) with LTO
GenF0.menu.opt.oslto.build.flags.optimize=-Os -flto
GenF0.menu.opt.o1std=Fast (-O1)
GenF0.menu.opt.o1std.build.flags.optimize=-O1
GenF0.menu.opt.o1lto=Fast (-O1) with LTO
GenF0.menu.opt.o1lto.build.flags.optimize=-O1 -flto
GenF0.menu.opt.o2std=Faster (-O2)
GenF0.menu.opt.o2std.build.flags.optimize=-O2
GenF0.menu.opt.o2lto=Faster (-O2) with LTO
GenF0.menu.opt.o2lto.build.flags.optimize=-O2 -flto
GenF0.menu.opt.o3std=Fastest (-O3)
GenF0.menu.opt.o3std.build.flags.optimize=-O3
GenF0.menu.opt.o3lto=Fastest (-O3) with LTO
GenF0.menu.opt.o3lto.build.flags.optimize=-O3 -flto
GenF0.menu.opt.ogstd=Debug (-Og)
GenF0.menu.opt.ogstd.build.flags.optimize=-Og
GenF0.menu.opt.o0std=No Optimization (-O0)
GenF0.menu.opt.o0std.build.flags.optimize=-O0

GenF1.menu.opt.osstd=Smallest (-Os default)
GenF1.menu.opt.oslto=Smallest (-Os) with LTO
GenF1.menu.opt.oslto.build.flags.optimize=-Os -flto
GenF1.menu.opt.o1std=Fast (-O1)
GenF1.menu.opt.o1std.build.flags.optimize=-O1
GenF1.menu.opt.o1lto=Fast (-O1) with LTO
GenF1.menu.opt.o1lto.build.flags.optimize=-O1 -flto
GenF1.menu.opt.o2std=Faster (-O2)
GenF1.menu.opt.o2std.build.flags.optimize=-O2
GenF1.menu.opt.o2lto=Faster (-O2) with LTO
GenF1.menu.opt.o2lto.build.flags.optimize=-O2 -flto
GenF1.menu.opt.o3std=Fastest (-O3)
GenF1.menu.opt.o3std.build.flags.optimize=-O3
GenF1.menu.opt.o3lto=Fastest (-O3) with LTO
GenF1.menu.opt.o3lto.build.flags.optimize=-O3 -flto
GenF1.menu.opt.ogstd=Debug (-Og)
GenF1.menu.opt.ogstd.build.flags.optimize=-Og
GenF1.menu.opt.o0std=No Optimization (-O0)
GenF1.menu.opt.o0std.build.flags.optimize=-O0

GenF2.menu.opt.osstd=Smallest (-Os default)
GenF2.menu.opt.oslto=Smallest (-Os) with LTO
GenF2.menu.opt.oslto.build.flags.optimize=-Os -flto
GenF2.menu.opt.o1std=Fast (-O1)
GenF2.menu.opt.o1std.build.flags.optimize=-O1
GenF2.menu.opt.o1lto=Fast (-O1) with LTO
GenF2.menu.opt.o1lto.build.flags.optimize=-O1 -flto
GenF2.menu.opt.o2std=Faster (-O2)
GenF2.menu.opt.o2std.build.flags.optimize=-O2
GenF2.menu.opt.o2lto=Faster (-O2) with LTO
GenF2.menu.opt.o2lto.build.flags.optimize=-O2 -flto
GenF2.menu.opt.o3std=Fastest (-O3)
GenF2.menu.opt.o3std.build.flags.optimize=-O3
GenF2.menu.opt.o3lto=Fastest (-O3) with LTO
GenF2.menu.opt.o3lto.build.flags.optimize=-O3 -flto
GenF2.menu.opt.ogstd=Debug (-Og)
GenF2.menu.opt.ogstd.build.flags.optimize=-Og
GenF2.menu.opt.o0std=No Optimization (-O0)
GenF2.menu.opt.o0std.build.flags.optimize=-O0

GenF3.menu.opt.osstd=Smallest (-Os default)
GenF3.menu.opt.oslto=Smallest (-Os) with LTO
GenF3.menu.opt.oslto.build.flags.optimize=-Os -flto
GenF3.menu.opt.o1std=Fast (-O1)
GenF3.menu.opt.o1std.build.flags.optimize=-O1
GenF3.menu.opt.o1lto=Fast (-O1) with LTO
GenF3.menu.opt.o1lto.build.flags.optimize=-O1 -flto
GenF3.menu.opt.o2std=Faster (-O2)
GenF3.menu.opt.o2std.build.flags.optimize=-O2
GenF3.menu.opt.o2lto=Faster (-O2) with LTO
GenF3.menu.opt.o2lto.build.flags.optimize=-O2 -flto
GenF3.menu.opt.o3std=Fastest (-O3)
GenF3.menu.opt.o3std.build.flags.optimize=-O3
GenF3.menu.opt.o3lto=Fastest (-O3) with LTO
GenF3.menu.opt.o3lto.build.flags.optimize=-O3 -flto
GenF3.menu.opt.ogstd=Debug (-Og)
GenF3.menu.opt.ogstd.build.flags.optimize=-Og
GenF3.menu.opt.o0std=No Optimization (-O0)
GenF3.menu.opt.o0std.build.flags.optimize=-O0

GenF4.menu.opt.osstd=Smallest (-Os default)
GenF4.menu.opt.oslto=Smallest (-Os) with LTO
GenF4.menu.opt.oslto.build.flags.optimize=-Os -flto
GenF4.menu.opt.o1std=Fast (-O1)
GenF4.menu.opt.o1std.build.flags.optimize=-O1
GenF4.menu.opt.o1lto=Fast (-O1) with LTO
GenF4.menu.opt.o1lto.build.flags.optimize=-O1 -flto
GenF4.menu.opt.o2std=Faster (-O2)
GenF4.menu.opt.o2std.build.flags.optimize=-O2
GenF4.menu.opt.o2lto=Faster (-O2) with LTO
GenF4.menu.opt.o2lto.build.flags.optimize=-O2 -flto
GenF4.menu.opt.o3std=Fastest (-O3)
GenF4.menu.opt.o3std.build.flags.optimize=-O3
GenF4.menu.opt.o3lto=Fastest (-O3) with LTO
GenF4.menu.opt.o3lto.build.flags.optimize=-O3 -flto
GenF4.menu.opt.ogstd=Debug (-Og)
GenF4.menu.opt.ogstd.build.flags.optimize=-Og
GenF4.menu.opt.o0std=No Optimization (-O0)
GenF4.menu.opt.o0std.build.flags.optimize=-O0

GenF7.menu.opt.osstd=Smallest (-Os default)
GenF7.menu.opt.oslto=Smallest (-Os) with LTO
GenF7.menu.opt.oslto.build.flags.optimize=-Os -flto
GenF7.menu.opt.o1std=Fast (-O1)
GenF7.menu.opt.o1std.build.flags.optimize=-O1
GenF7.menu.opt.o1lto=Fast (-O1) with LTO
GenF7.menu.opt.o1lto.build.flags.optimize=-O1 -flto
GenF7.menu.opt.o2std=Faster (-O2)
GenF7.menu.opt.o2std.build.flags.optimize=-O2
GenF7.menu.opt.o2lto=Faster (-O2) with LTO
GenF7.menu.opt.o2lto.build.flags.optimize=-O2 -flto
GenF7.menu.opt.o3std=Fastest (-O3)
GenF7.menu.opt.o3std.build.flags.optimize=-O3
GenF7.menu.opt.o3lto=Fastest (-O3) with LTO
GenF7.menu.opt.o3lto.build.flags.optimize=-O3 -flto
GenF7.menu.opt.ogstd=Debug (-Og)
GenF7.menu.opt.ogstd.build.flags.optimize=-Og
GenF7.menu.opt.o0std=No Optimization (-O0)
GenF7.menu.opt.o0std.build.flags.optimize=-O0

GenG0.menu.opt.osstd=Smallest (-Os default)
GenG0.menu.opt.oslto=Smallest (-Os) with LTO
GenG0.menu.opt.oslto.build.flags.optimize=-Os -flto
GenG0.menu.opt.o1std=Fast (-O1)
GenG0.menu.opt.o1std.build.flags.optimize=-O1
GenG0.menu.opt.o1lto=Fast (-O1) with LTO
GenG0.menu.opt.o1lto.build.flags.optimize=-O1 -flto
GenG0.menu.opt.o2std=Faster (-O2)
GenG0.menu.opt.o2std.build.flags.optimize=-O2
GenG0.menu.opt.o2lto=Faster (-O2) with LTO
GenG0.menu.opt.o2lto.build.flags.optimize=-O2 -flto
GenG0.menu.opt.o3std=Fastest (-O3)
GenG0.menu.opt.o3std.build.flags.optimize=-O3
GenG0.menu.opt.o3lto=Fastest (-O3) with LTO
GenG0.menu.opt.o3lto.build.flags.optimize=-O3 -flto
GenG0.menu.opt.ogstd=Debug (-Og)
GenG0.menu.opt.ogstd.build.flags.optimize=-Og
GenG0.menu.opt.o0std=No Optimization (-O0)
GenG0.menu.opt.o0std.build.flags.optimize=-O0

GenG4.menu.opt.osstd=Smallest (-Os default)
GenG4.menu.opt.oslto=Smallest (-Os) with LTO
GenG4.menu.opt.oslto.build.flags.optimize=-Os -flto
GenG4.menu.opt.o1std=Fast (-O1)
GenG4.menu.opt.o1std.build.flags.optimize=-O1
GenG4.menu.opt.o1lto=Fast (-O1) with LTO
GenG4.menu.opt.o1lto.build.flags.optimize=-O1 -flto
GenG4.menu.opt.o2std=Faster (-O2)
GenG4.menu.opt.o2std.build.flags.optimize=-O2
GenG4.menu.opt.o2lto=Faster (-O2) with LTO
GenG4.menu.opt.o2lto.build.flags.optimize=-O2 -flto
GenG4.menu.opt.o3std=Fastest (-O3)
GenG4.menu.opt.o3std.build.flags.optimize=-O3
GenG4.menu.opt.o3lto=Fastest (-O3) with LTO
GenG4.menu.opt.o3lto.build.flags.optimize=-O3 -flto
GenG4.menu.opt.ogstd=Debug (-Og)
GenG4.menu.opt.ogstd.build.flags.optimize=-Og
GenG4.menu.opt.o0std=No Optimization (-O0)
GenG4.menu.opt.o0std.build.flags.optimize=-O0

GenH5.menu.opt.osstd=Smallest (-Os default)
GenH5.menu.opt.osstd.build.flags.optimize=-Os
GenH5.menu.opt.oslto=Smallest (-Os) with LTO
GenH5.menu.opt.oslto.build.flags.optimize=-Os -flto
GenH5.menu.opt.o1std=Fast (-O1)
GenH5.menu.opt.o1std.build.flags.optimize=-O1
GenH5.menu.opt.o1lto=Fast (-O1) with LTO
GenH5.menu.opt.o1lto.build.flags.optimize=-O1 -flto
GenH5.menu.opt.o2std=Faster (-O2)
GenH5.menu.opt.o2std.build.flags.optimize=-O2
GenH5.menu.opt.o2lto=Faster (-O2) with LTO
GenH5.menu.opt.o2lto.build.flags.optimize=-O2 -flto
GenH5.menu.opt.o3std=Fastest (-O3)
GenH5.menu.opt.o3std.build.flags.optimize=-O3
GenH5.menu.opt.o3lto=Fastest (-O3) with LTO
GenH5.menu.opt.o3lto.build.flags.optimize=-O3 -flto
GenH5.menu.opt.ogstd=Debug (-Og)
GenH5.menu.opt.ogstd.build.flags.optimize=-Og
GenH5.menu.opt.o0std=No Optimization (-O0)
GenH5.menu.opt.o0std.build.flags.optimize=-O0

GenH7.menu.opt.osstd=Smallest (-Os default)
GenH7.menu.opt.oslto=Smallest (-Os) with LTO
GenH7.menu.opt.oslto.build.flags.optimize=-Os -flto
GenH7.menu.opt.o1std=Fast (-O1)
GenH7.menu.opt.o1std.build.flags.optimize=-O1
GenH7.menu.opt.o1lto=Fast (-O1) with LTO
GenH7.menu.opt.o1lto.build.flags.optimize=-O1 -flto
GenH7.menu.opt.o2std=Faster (-O2)
GenH7.menu.opt.o2std.build.flags.optimize=-O2
GenH7.menu.opt.o2lto=Faster (-O2) with LTO
GenH7.menu.opt.o2lto.build.flags.optimize=-O2 -flto
GenH7.menu.opt.o3std=Fastest (-O3)
GenH7.menu.opt.o3std.build.flags.optimize=-O3
GenH7.menu.opt.o3lto=Fastest (-O3) with LTO
GenH7.menu.opt.o3lto.build.flags.optimize=-O3 -flto
GenH7.menu.opt.ogstd=Debug (-Og)
GenH7.menu.opt.ogstd.build.flags.optimize=-Og
GenH7.menu.opt.o0std=No Optimization (-O0)
GenH7.menu.opt.o0std.build.flags.optimize=-O0

