chcbaram/CODING_SOGUL_STM32/boards.txt
GenL0.menu.opt.osstd=Smallest (-Os default)
GenL0.menu.opt.oslto=Smallest (-Os) with LTO
GenL0.menu.opt.oslto.build.flags.optimize=-Os -flto
GenL0.menu.opt.o1std=Fast (-O1)
GenL0.menu.opt.o1std.build.flags.optimize=-O1
GenL0.menu.opt.o1lto=Fast (-O1) with LTO
GenL0.menu.opt.o1lto.build.flags.optimize=-O1 -flto
GenL0.menu.opt.o2std=Faster (-O2)
GenL0.menu.opt.o2std.build.flags.optimize=-O2
GenL0.menu.opt.o2lto=Faster (-O2) with LTO
GenL0.menu.opt.o2lto.build.flags.optimize=-O2 -flto
GenL0.menu.opt.o3std=Fastest (-O3)
GenL0.menu.opt.o3std.build.flags.optimize=-O3
GenL0.menu.opt.o3lto=Fastest (-O3) with LTO
GenL0.menu.opt.o3lto.build.flags.optimize=-O3 -flto
GenL0.menu.opt.ogstd=Debug (-Og)
GenL0.menu.opt.ogstd.build.flags.optimize=-Og
GenL0.menu.opt.o0std=No Optimization (-O0)
GenL0.menu.opt.o0std.build.flags.optimize=-O0

GenL1.menu.opt.osstd=Smallest (-Os default)
GenL1.menu.opt.oslto=Smallest (-Os) with LTO
GenL1.menu.opt.oslto.build.flags.optimize=-Os -flto
GenL1.menu.opt.o1std=Fast (-O1)
GenL1.menu.opt.o1std.build.flags.optimize=-O1
GenL1.menu.opt.o1lto=Fast (-O1) with LTO
GenL1.menu.opt.o1lto.build.flags.optimize=-O1 -flto
GenL1.menu.opt.o2std=Faster (-O2)
GenL1.menu.opt.o2std.build.flags.optimize=-O2
GenL1.menu.opt.o2lto=Faster (-O2) with LTO
GenL1.menu.opt.o2lto.build.flags.optimize=-O2 -flto
GenL1.menu.opt.o3std=Fastest (-O3)
GenL1.menu.opt.o3std.build.flags.optimize=-O3
GenL1.menu.opt.o3lto=Fastest (-O3) with LTO
GenL1.menu.opt.o3lto.build.flags.optimize=-O3 -flto
GenL1.menu.opt.ogstd=Debug (-Og)
GenL1.menu.opt.ogstd.build.flags.optimize=-Og
GenL1.menu.opt.o0std=No Optimization (-O0)
GenL1.menu.opt.o0std.build.flags.optimize=-O0

GenL4.menu.opt.osstd=Smallest (-Os default)
GenL4.menu.opt.oslto=Smallest (-Os) with LTO
GenL4.menu.opt.oslto.build.flags.optimize=-Os -flto
GenL4.menu.opt.o1std=Fast (-O1)
GenL4.menu.opt.o1std.build.flags.optimize=-O1
GenL4.menu.opt.o1lto=Fast (-O1) with LTO
GenL4.menu.opt.o1lto.build.flags.optimize=-O1 -flto
GenL4.menu.opt.o2std=Faster (-O2)
GenL4.menu.opt.o2std.build.flags.optimize=-O2
GenL4.menu.opt.o2lto=Faster (-O2) with LTO
GenL4.menu.opt.o2lto.build.flags.optimize=-O2 -flto
GenL4.menu.opt.o3std=Fastest (-O3)
GenL4.menu.opt.o3std.build.flags.optimize=-O3
GenL4.menu.opt.o3lto=Fastest (-O3) with LTO
GenL4.menu.opt.o3lto.build.flags.optimize=-O3 -flto
GenL4.menu.opt.ogstd=Debug (-Og)
GenL4.menu.opt.ogstd.build.flags.optimize=-Og
GenL4.menu.opt.o0std=No Optimization (-O0)
GenL4.menu.opt.o0std.build.flags.optimize=-O0

GenL5.menu.opt.osstd=Smallest (-Os default)
GenL5.menu.opt.oslto=Smallest (-Os) with LTO
GenL5.menu.opt.oslto.build.flags.optimize=-Os -flto
GenL5.menu.opt.o1std=Fast (-O1)
GenL5.menu.opt.o1std.build.flags.optimize=-O1
GenL5.menu.opt.o1lto=Fast (-O1) with LTO
GenL5.menu.opt.o1lto.build.flags.optimize=-O1 -flto
GenL5.menu.opt.o2std=Faster (-O2)
GenL5.menu.opt.o2std.build.flags.optimize=-O2
GenL5.menu.opt.o2lto=Faster (-O2) with LTO
GenL5.menu.opt.o2lto.build.flags.optimize=-O2 -flto
GenL5.menu.opt.o3std=Fastest (-O3)
GenL5.menu.opt.o3std.build.flags.optimize=-O3
GenL5.menu.opt.o3lto=Fastest (-O3) with LTO
GenL5.menu.opt.o3lto.build.flags.optimize=-O3 -flto
GenL5.menu.opt.ogstd=Debug (-Og)
GenL5.menu.opt.ogstd.build.flags.optimize=-Og
GenL5.menu.opt.o0std=No Optimization (-O0)
GenL5.menu.opt.o0std.build.flags.optimize=-O0

GenU5.menu.opt.osstd=Smallest (-Os default)
GenU5.menu.opt.osstd.build.flags.optimize=-Os
GenU5.menu.opt.oslto=Smallest (-Os) with LTO
GenU5.menu.opt.oslto.build.flags.optimize=-Os -flto
GenU5.menu.opt.o1std=Fast (-O1)
GenU5.menu.opt.o1std.build.flags.optimize=-O1
GenU5.menu.opt.o1lto=Fast (-O1) with LTO
GenU5.menu.opt.o1lto.build.flags.optimize=-O1 -flto
GenU5.menu.opt.o2std=Faster (-O2)
GenU5.menu.opt.o2std.build.flags.optimize=-O2
GenU5.menu.opt.o2lto=Faster (-O2) with LTO
GenU5.menu.opt.o2lto.build.flags.optimize=-O2 -flto
GenU5.menu.opt.o3std=Fastest (-O3)
GenU5.menu.opt.o3std.build.flags.optimize=-O3
GenU5.menu.opt.o3lto=Fastest (-O3) with LTO
GenU5.menu.opt.o3lto.build.flags.optimize=-O3 -flto
GenU5.menu.opt.ogstd=Debug (-Og)
GenU5.menu.opt.ogstd.build.flags.optimize=-Og
GenU5.menu.opt.o0std=No Optimization (-O0)
GenU5.menu.opt.o0std.build.flags.optimize=-O0


# Debug information
Nucleo_144.menu.dbg.none=None
Nucleo_144.menu.dbg.enable_sym=Symbols Enabled (-g)
Nucleo_144.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
Nucleo_144.menu.dbg.enable_log=Core logs Enabled
Nucleo_144.menu.dbg.enable_log.build.flags.debug=
Nucleo_144.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
Nucleo_144.menu.dbg.enable_all.build.flags.debug=-g

Nucleo_64.menu.dbg.none=None
Nucleo_64.menu.dbg.enable_sym=Symbols Enabled (-g)
Nucleo_64.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
Nucleo_64.menu.dbg.enable_log=Core logs Enabled
Nucleo_64.menu.dbg.enable_log.build.flags.debug=
Nucleo_64.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
Nucleo_64.menu.dbg.enable_all.build.flags.debug=-g

Nucleo_32.menu.dbg.none=None
Nucleo_32.menu.dbg.enable_sym=Symbols Enabled (-g)
Nucleo_32.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
Nucleo_32.menu.dbg.enable_log=Core logs Enabled
Nucleo_32.menu.dbg.enable_log.build.flags.debug=
Nucleo_32.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
Nucleo_32.menu.dbg.enable_all.build.flags.debug=-g

Disco.menu.dbg.none=None
Disco.menu.dbg.enable_sym=Symbols Enabled (-g)
Disco.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
Disco.menu.dbg.enable_log=Core logs Enabled
Disco.menu.dbg.enable_log.build.flags.debug=
Disco.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
Disco.menu.dbg.enable_all.build.flags.debug=-g

Eval.menu.dbg.none=None
Eval.menu.dbg.enable_sym=Symbols Enabled (-g)
Eval.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
Eval.menu.dbg.enable_log=Core logs Enabled
Eval.menu.dbg.enable_log.build.flags.debug=
Eval.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
Eval.menu.dbg.enable_all.build.flags.debug=-g


GenC0.menu.dbg.none=None
GenC0.menu.dbg.enable=Enabled (-g)
GenC0.menu.dbg.enable.build.flags.debug=-g

GenF0.menu.dbg.none=None
GenF0.menu.dbg.enable_sym=Symbols Enabled (-g)
GenF0.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
GenF0.menu.dbg.enable_log=Core logs Enabled
GenF0.menu.dbg.enable_log.build.flags.debug=
GenF0.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
GenF0.menu.dbg.enable_all.build.flags.debug=-g

GenF1.menu.dbg.none=None
GenF1.menu.dbg.enable_sym=Symbols Enabled (-g)
GenF1.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
GenF1.menu.dbg.enable_log=Core logs Enabled
GenF1.menu.dbg.enable_log.build.flags.debug=
GenF1.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
GenF1.menu.dbg.enable_all.build.flags.debug=-g

GenF2.menu.dbg.none=None
GenF2.menu.dbg.enable_sym=Symbols Enabled (-g)
GenF2.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
GenF2.menu.dbg.enable_log=Core logs Enabled
GenF2.menu.dbg.enable_log.build.flags.debug=
GenF2.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
GenF2.menu.dbg.enable_all.build.flags.debug=-g

GenF3.menu.dbg.none=None
GenF3.menu.dbg.enable_sym=Symbols Enabled (-g)
GenF3.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
GenF3.menu.dbg.enable_log=Core logs Enabled
GenF3.menu.dbg.enable_log.build.flags.debug=
GenF3.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
GenF3.menu.dbg.enable_all.build.flags.debug=-g

